[{"created":1665131354262,"modified":1665150654286,"title":"Making Glyph Learnable","status":"In Progress","tags":["glyph"],"blocks":["#Affordances over time"],"blocks_text":["\n\nSoftware interfaces expose you to much complexity early on. Framer and figma both just drop you in with the ability to do everything. They should expose it in layers or modes  \n\n\n","\n\nInclude a design exercise as first step "],"filename":"making_glyph_learnable"},{"created":1672241190073,"modified":1672241276242,"title":"notifications manager","status":"In Progress","tags":["eka"],"blocks":[],"blocks_text":[],"filename":"notifications_manager"},{"created":1673256239924,"modified":1673256598845,"title":"2020 in review","status":"In Progress","tags":["whoami"],"blocks":["Introduction","Trauma","Growth v Balance","Strengths v Weaknesses","Community","The Opacity of Others","Work Balance"],"blocks_text":["\n\nI reflected a number of times on trauma and history. A number of pieces I read looked at how our individual histories keep impacting us and coming back to affect us. Even if events happened a long time ago, they are still impacting how we think and move through the world. I choose to use the word **trauma** because we have a more solid framework around it. We understand that traumatic experiences can still affect our emotions. But I want to expand the scope of how we think about what trauma is and the impact of our personal histories.\n\nOur history is something that is constantly impacting us. Whenever we make decisions or act in certain ways, we are calling on our history of experiences to help us. That history can be helpful but it can also be harmful. When we face an experience, we use similar historical experiences to guide us. This can happen both consciously but also unconsciously. If those historical experiences are still relevant, that can be a useful exercise. But we also can bring the baggage from our previous experiences and it can blind us to what is actually in front of us. We might feel more insecure in our current romantic relationship because of other previous relationships.\n\nThe most difficult part to understand the impact of our history is that we are not always conscious of the ways it is impacting us. In our head we might have a narrative about why we are making a decision, but that narrative can miss the impact of our history. It takes an active effort to recognize that we are feeling a certain way because of a historical experience. Once we recognize this, we can then ask ourselves is this feeling valid or actually detrimental.\n","\nBefore this year, I was all in on the idea of growth mindset. I was constantly thinking about the ways that I wanted to improve myself. But this year has forced me to recognize that a growth mindset might not be sustainable. That type of focus will not lead to long term happiness and peace. By focusing on the ways I wanted to grow, I am also subtly critiquing the person that I am today. I also never had a fixed target of where I wanted to be. How much growth was enough? I could make progress on some things but then still want to make even more.\n\nInstead of focusing on growth, I am looking for **balance**. Balance is not a passive resting place though. Balance is a constant moving target. Everyday there are external forces pushing us in different directions. Those forces could come from your work, from what you read, from other people’s opinions. Balance inherently understands that we will never be finished. We have to accurately understand where we are today and adjust accordingly. Some days we might be off balance in one direction and other days we will be off balance in the opposite direction.\n","\n\nOur strengths and our weaknesses are tightly intertwined. This year helped me understand that I do not have certain things I am strong at and certain things I am weak at. The things I am weak at are directly related to the things that I am strong at. Strengths cannot exist without weaknesses also existing. This understanding allows for a deeper picture in thinking about my own identity and makes it easier to accept my own weaknesses.\nRelated to the idea of balance, I am not going to be able to just remove weaknesses and add strengths. When I have a strength, I also have a weakness that is connected to that same trait. Understanding this gives me a fuller picture. What I had previously framed as a weakness is actually connected to something that I view as a strength. This allows me to better understand where that weakness comes from and how to work with it rather than try to get rid of it.\n","\nThe people that I surround myself with is one of the largest determinants of my direction. In the balance section I mentioned how there are external forces that influence us. One of the largest ones is the people that I am interacting with regularly.\n\nWhile individual relationships are important, this year has made me reflect on how community can be even more powerful. A community is larger than just individual interactions with different people. Community shows the power of a group of people coming together united about something. The communities principles or mission become larger than anyone one person.\n\nOne of the most difficult parts of 2020 has been how it is harder to have community.\n","\n\nIt is easy to forgot how hard it is to truly know what is going on with someone else. Many of the books I read touched on both the difficulty of understanding others and how others might have difficulty understanding you. We have such a deep relationship with our own thoughts and identity. We do not come anywhere near having such an intimate relationship with others as we do with our own thoughts. This asymmetry can make it difficult to recognize others for who they really are. We build stories about others and make assumptions about what they are thinking.\n\nIt requires constant effort to try and understand someone else. We should not expect others to understand us unless we communicate with them and we must provide others with the space to communicate about themselves with us. This requires having different standards and expectations for ourselves then we have with others. I want to push myself to communicate what is going on with myself as much as possible while also expecting that others will not necessarily share themselves unless I provide the space for them.\n","\nAfter this year I recognize the importance of having more distance from my work. Before this year I probably would have said that my ideal schedule would be working about 5 hours everyday rather than having a weekend. After this year I think it is really important to have long stretches of time where I am not thinking about work at all.\n\nThere were many nights this year were I lay awake not being able to fall asleep thinking about work. I was thinking about how to solve some problem or what I had to get done the next day. I was unable to quiet my mind and get the distance from work that I needed. When I was able to get away from work this year, it was such a respite. When I took a few weeks off it felt like such a weight off my shoulders. But even when I took a few weeks off, it took about a week before I really felt like I had distance from work. When I spend so much of my time working, it can be really difficult to get away. It is not about just not working, but also having ample time for work to feel like it was not recent.\n"],"filename":"2020_in_review"},{"created":1669546355930,"modified":1673988169246,"title":"Response to Vision of Metascience","status":"Finished","tags":["media_response","organization_structure"],"blocks":["Introduction","How to Create Decisive Results","Comparing a new structure to a baseline","Evaluating present day programs","Ensuring Process grows to the correct size"],"blocks_text":["\nI enjoyed reading Nielsen and Qiu’s recent piece about their [vision of meta science](https:\/\/scienceplusplus.org\/metascience\/). Their piece connects to my desire to understand how to do good work at a personal level. During my career, I have noticed how much the environment that I am in impacts the quality of my work . In technology companies, there is generally some energy devoted to improving the environments we work in. People talk about meeting schedules, creating opportunities for deep work and optimizing how often teams plan. Nielsen and Qiu take an even higher level view than that. They explore how societal structures create incentives which impact output in knowledge work environments.  They are not thinking about the output of one person, or one company, or one sector, but how to create societal wide structures for improving the way we generate knowledge.\n\nNielsen and Qiu’s strategy to persuade the reader that we should spend more energy exploring alternative structures is to show many examples of new structures which might have different outcomes. I find this app0roach to be quite persuasive because it is grounded in concrete suggestions. It is easy to get excited about exploring the large design space they present of possible structures. By showing how large this space is, and how under explored it is they motivate the importance of creating an ecosystem that helps us explore. \n","\n\nTo explore this space of scientific structures we first need to understand how our current scientific structures are performing today. This understanding will help us make sense of what is happening when we explore a new structure. Nielsen and Qiu explain that this exploration requires the ability to create  **decisive results**.  A decisive result is a finding that is  *“strong enough to drive real change“*. Being able to collect this type of evidence is important because it can *“convince you of things you regard as a priori unlikely or distasteful“*.  \n\n**Decisive Results** are critical because there are currently conflicting opinions about what scientific systems work best. Current discussions about what works best are mostly grounded in rhetoric since it is difficult to evaluate outcomes and test new directions.  The ability to generate **decisive results** would move our discussions from purely theoretical to grounded in experimentation. We could learn which structures outperform others and even those who did not initially like a new structure would have to agree that it is beneficial. If our results are not strong enough to convince those who have different opinions, then it will be difficult to make system wide progress.\n\nCreating an ecosystem where decisive results are regularly obtained will require these three abilities:  \n1. The ability to try a new system \/ structure.\n2. The ability to collect evidence about how this new structure is working\n3. A method for comparing the evidence collected in step 2 with baseline measures of effectiveness.\n\nWhile the process of creating a **decisive result** moves from step 1 to step 3, I am going to discuss them in the opposite direction.\n","\n\nTo evaluate a new scientific structure we need information about how other programs perform that we can compare it with. Without a comparison point, knowing that a scientific program creates a breakthrough finding every three years does not help us. If other programs only make one breakthrough every ten years though, we can understand that our new program represents a performance improvement and we should look into expanding it.\n\nAn important starting point for meta science is to evaluate how existing research programs are performing. In Nielsen and Qiu’s piece they mention the [Shanghai Rankings](https:\/\/www.shanghairanking.com\/) as one way to evaluate the quality of a research university. We need other measures that look at many different scientific programs. We should develop many different metrics that are trying to evaluate research programs in different perspectives. It will be important that these metrics look at different levels of granularity as well. Rather than only focusing on the entire university, we could look at departments, labs or even individual researchers. Doing many experiments trying to measure scientific endeavors will help us both understand what is currently working today, but also improve our measurement ability going forward. \n\nTo avoid the key difficulty of evaluating researching programs when **outcomes are not clear until far in the future**, I would start by working on evaluating the success of historical programs. Nielsen and Qiu propose such an idea when they suggest using the history of science as a basis for program evaluation. Using historical programs is an easier starting point because the passing of time provides clarity by showing us which work gets extended the most. The most influential works are the ones that open up many new lines of discovery. In the present it is difficult to know which results are going to be continually built on.\n\nTo push forward this measurement project I would give out mini grants for people to try evaluating programs in different ways. The application would have the person specify a few different similar programs they want to measure and a few ideas for different approaches to measure those programs. This mini grant program would hopeful generate a diverse set of ideas about how to evaluate programs. The results from all the studies could also generate some initial baseline measures of effectiveness. Before running experiments with new structures, it seems important to use existing data to generate better evaluation techniques.\n","\nThis historical approach could generate initial baselines and some new measurement instruments, but it will not generalize to measurement on a smaller time scale. While making improvements over a long time scale is important, the quicker we can get high quality feedback on program effectiveness the more transformative a meta science ecosystem will be.\n\nA current common approach to evaluating the effectiveness of research is by asking experts in the field for their opinion. While this approach is not terrible, Nielsen and Qiu raise concerns that it can lead to a lot of centralization. Experts are more likely to rate work highly which is similar to their own work. An important part of their vision for metascience is that riskier work and people who are outsiders should be able to have success. Using experts opinion to evaluate research will probably not lead to the diversity and decentralization that Nielsen and Qiu believe is critical. \n\nWe can take lessons about how to design a metascience ecosystem where there is both decentralization and diversity in the surfacing of work from another system, Tiktok. On Tiktok, any video from any creator can rise to the top. People with no prior success or fan bases are consistently able to create videos that outperform those who have had a lot of success in the past. Tiktok is able to achieve this, by crowd sourcing which content is good. An approach that is similar to asking a panel of experts might be what HBO or the movie industry do. While that more centralized approach can be successful Tiktok is a perfect example of how leaning into diversity and decentralization can create all sorts of new outcomes that were previously missed.\n\nTikTok’s approach of using the entire population to evaluate the quality of content might not be a perfect fit for evaluating research outcomes though. Everyone on Tiktok is relatively equally able to identify if a video is entertaining. It is a much more difficult task to understand how likely it is that a research project is important. One medium between these two approaches might be to use [prediction markets](https:\/\/astralcodexten.substack.com\/p\/prediction-market-faq?publication_id=89120&post_id=91718311&isFreemail=false).  Prediction markets can be used to evaluate which programs will be the most influential. This would work by creating a prediction market where individuals would bet on how important a piece of research will be in ten years from now. Anyone will have the ability to place a monetary bet based on how confident they are about that outcome. In the long run these prediction markets should in aggregate predict which research outcomes will be the most influential. Using prediction markets has the added benefit of creating a monetary incentive for those who are good at evaluating how important research is.\n\nActually implementing prediction markets for evaluating research is a complex process, that will involve careful design. It is important that the markets resolve on a quick enough time scale that people are incentivized to participate in them. It is also possible that the research which is most influential in ten years will be different than the research that is most influential in twenty years. For prediction markets to work well it will be important to design the markets so they create the right incentives. Prediction markets  seem like they could be a powerful way to remove some of the centralization that currently exists in evaluating research.\n\nIf using a mini grant program allows us to generate baseline measures of effectiveness and prediction markets helps us evaluate new research programs than we might be able to generate decisive results. The last step is the ability to try new programs. This part is mostly reliant on having money. If there is money to fund new programs we now have the tools to evaluate that program.\n","\nOnce we can generate **decisive results** there are still open questions about how to use those results to update our scientific ecosystem.  Nielsen and Qiu refer to one aspect of this as the *unbounded growth problem*. Imagine we have tested a new program finding it to be more effective than all other programs. It is still not clear what we should do with this evidence. Should we destroy all other programs and make this the only scientific program that exists? How much funding should we devote to this program? Does our measurement of the effectiveness of the program also apply when the program is larger?\n\nSimilar to how we took inspiration from Tiktok above, we could learn lessons about how to update our scientific ecosystem from ecosystems in nature. In nature, an ecosystem has many different creatures coexisting at the same time. Each creature is dependent on the existence of other creatures for its survival. An animal needs  fruit for sustenance, and the fruit needs the animal to spread its seeds. If a creature’s population becomes too large, it hurts other creatures in turn hurting itself. We could aim to develop a scientific ecosystem that has similar properties. In this comparison each scientific program is a creature in our ecosystem. We want a system where the success of programs is also dependent on the success of other programs. If one program gets too big this will hurt the other programs which will in turn hurt itself. \n\nWe need to combine this balancing property with making our ecosystem responsive to feedback.  If we introduce a new program into our ecosystem which is effective, we want it to grow. This requires a mechanism which gives programs that are successful the ability to grow. One area that is good at growing in response to success is revenue generating companies. When a company creates a product that is successful, it generates revenue which it re-invests into growth. This makes revenue generating companies incredibly responsive to feedback.\n\nIn our scientific ecosystem, we want to achieve the following two properties.\n1. Programs successes are somewhat connected to each other so that no one program becomes too large\n2. Programs are responsive tp feedback meaning programs that do well grow larger and programs that are unsuccessful die out\n\nWe might be able to achieve this by creating a web of research programs which is supported by revenue generating products. For this to work, we need to develop a system which appropriately passes revenue back up the value chain to the different programs. For each product there will hopefully be a number of different research programs which created the necessary insights for that product to succeed. Revenue will be given to these research programs in accordance with how much value they deliver to the product. This returning of revenue will help the ones that are generating lots of value grow large. Bringing a product to market will be dependent on multiple different programs serving different roles and so no one program should get too large, because it is dependent on the success of other programs for revenue.\n\nIn this proposed set up, the ultimate determinant of success is if the research contributes to a revenue generating product. I am sure this is problematic in that not all research that we want to happen will lend itself naturally to a product. That means this should be only one ecosystem among many. One difficulty of this eco system though might be that certain research will only lead to products on a very long time scale. These programs that are working on a longer time scale might grow less than programs which contribute to more immediate products. We could counter act this immediacy incentive by including our prediction market idea from earlier. Some of the money from the revenue generating products gets put aside and given to programs which are rated the highest in the prediction market outcomes.\n\nA key to creating an ecosystem that uses revenue generating products to regulate the size of research programs will be creating new tools to help with attributing how much of a product’s success came from each research program. \n\n"],"filename":"response_to_vision_of_metascience"},{"created":1674036708983,"modified":1674572894953,"title":"My tooling - Eka","status":"In Progress","tags":["eka"],"blocks":[],"blocks_text":[],"filename":"my_tooling_-_eka"},{"created":1667475799731,"modified":1675179450217,"title":"Timeful texts \/ Spaced Repition \/ The Return","status":"In Progress","tags":["eka","learning"],"blocks":["Spaced Repetition Theory","Spaced Repetition Enhanced","Features"],"blocks_text":["\n\n\nReturning to it is not only for memory. But forces you to organize and make connections. Makes it easy to sort it into a category. \n\nSome cards are my own ideas. Some cards are other people’s ideas. Ideas I want to return to\n- can make cards different color depending on my idea vs others\n\n* Have cards with hierarchy \n* we start with the simple cards and work up to big ones\n\n* Have the ability to connect cards\n\n","\n\nMochi does a super good job using hot keys or keyboard shortcuts to make things super quick. I should do that too\n\nThe multiplier \/ scheduler Mochi uses I dont like. I basically want to give it a custom schedule. I want the option to retire \/ delete a card. And then I want to schedule it for the next time. I do not want cards to disappear generally and want them to keep surfacing back into my mind\n- make card\n- 2 days\n- 4 days\n- 7 days\n- 14 days\n- 30 days\n- 30 days\n- 30 days\n- retire\n\nAffordances at the card level\n- want to be able to split a card into two cards\n- Have the ability to tag cards.\n* have the ability to easily send something to a later date\n* have the ability to easily see what is scheduled for a date\n* have the ability to change when something is scheduled\n\n\n* In one card I want the following things:\n\t* a link to the original source\n\t* the text that I highlighted\n\t* how I then transformed that into a flash card\n\n"],"filename":"timeful_texts_\/_spaced_repition_\/_the_return"},{"created":1673258647986,"modified":1675185630415,"title":"2021 in Review","status":"In Progress","tags":["whoami"],"blocks":["Introduction"],"blocks_text":["\n\n# Community and Friendships\nDuring 2020, I spent most of my time in Baton Rouge with Jenny’s family. While the first year of covid passed safely, I struggled with how far away I felt from friendship and community at times. There are a few different places I put in effort in 2021 that have been really rewarding.\n\n* I started a book club with my friend  [Madison](https:\/\/www.thegirlandthelamb.com\/) . This book club has been so rewarding. It has been a way to connect with some of my friends and to read different things then I am used to. It has challenged me to think deeply about books in a different way. Because of book club I feel less pull to writing  [book notes](https:\/\/judahgnewman.com\/#\/medium\/book) . Since I am reflecting on these books with others, it satisfies the same itch. Book club has been so much fun because it both has strengthened my relationships with the people in the book club as individuals as well as forming a community that I feel like I am a part of.\n\n* Jenny and I moved to Cambridge, MA this year because she started her PHD at MIT. Moving to a new city meant that we are now far away from a lot of the friends we have previously made. This meant we had to work at making new friends and forming connections. After a little less that half a year in Boston, it feels like we have made some really good friends that I am excited to continue spending time with. I love connecting with new people. The beginning of a relationship contains so much learning and understanding about fundamental aspects of another person.\n\n* Since I graduated from college a few years ago, I have been struggling with what a friendship looks like. Until I graduated college most of my friends were people that I saw on a regular basis. They were people who lived in the same place as me and did the same things as me. But as my friends started to spread out and pursue their own directions that meant a lot of the people who I cared about live far away. This year I have finally started to feel secure and comfortable in what friendship looks like when I live far away from others. Jenny and I spent a lot of our summer visiting friends and it was great to reconnect with people I have not seen in a while.\n\n* After moving to Boston I started volunteering tutoring math at a local public school. Volunteering is something that I have really wanted to do more of and I am glad that I have found a way to do that through  [Boston Partners in Education](https:\/\/bostonpartners.org\/) . Working remotely it is easy to not be as attached to my immediate local surroundings. Volunteering is a great way for me to meet and learn from people who I otherwise would not interact with on a daily basis.\n\n* Jenny and I have gotten really into practicing Ashtanga Yoga. Slowly over the past few years I had been doing more and more Yoga. Most of that was following YouTube videos. In Boston, Jenny found a yoga studio that we really like and a teacher who teaches Ashtanga. Ashtanga is a little bit different than some other main stream yoga. It is the same practice every time. Ashtanga is really challenging but it feels good to work hard at something with a community of other people and slowly make progress on it. I really enjoy all the other people who have been practicing with us and the weekly ritual of going to yoga class.\n\nAll of these changes in the past year have made me feel a lot happier and secure socially on a day to day basis. Working remote means that I am not seeing people face to face as much and so it is really important for me to have the right social outlets that bring connection and fulfillment.\n","\n# Phase Transition\nThe past few months have felt a little bit like a phase transition in Jenny and my life. The past three years since we graduated from college have been one section in our lives and we are transitioning to the next one. The past section involved Jenny and me understanding our relationship better and what it will look like going forward. It was about us learning how to take care of ourselves and how to live a healthy life. We were able to explore living in a few different places and working at a few different jobs to get a better understanding of what things are most important to us.\n\nNow that Jenny has started her PHD, we are going to be living in Boston for the next few years. While we still have much to learn and change, it feels like we have built a really solid foundation. We have learned a lot about ourselves, what we are passionate about and how we want to move through the world.\nNow that we have these building blocks in place, it feels like both of us can start being ambitious in some other areas. Jenny is exploring what it means to do economic research and complete a PHD. I feel very solid in my career at Whisper and am excited about the work I am going to continue doing there. I have learned how to balance my work life with some pursuits outside of work and the importance of having those other pursuits.\n\nUsing this base, I have some goals that I want to pursue in 2022. These goals are ambitious so I would not be surprised if I do not meet all of them, but I am excited about being ambitious with them.\n","\n\n# Goals\n* My main project outside of work is going to be  [Repeated Generator](https:\/\/repeatedgenerator.netlify.app\/) . I am exploring how I can improve my own writing practice and idea generation process.\n* For the past couple of years I have flirted with reading textbooks. I never found a good method to read textbooks and maintain the knowledge I was reading. Towards the end of the year I started using Spaced Repetition and I think that holds promise for making reading textbooks more rewarding. I have a couple of textbook reading groups I am trying to be in this year.\n* This is the year I finally get my drivers license. During the holidays I have been doing some driving in Baton Rouge and should be able to get my license later this year in Boston.\n* By the time I am 30, I want to make some serious progress on learning Chinese. I do not know what serious progress means, but it feels like this year I should at least start developing a plan for learning chinese.\n* I spent some time in 2021 thinking about  [career funding](https:\/\/judahgnewman.com\/#\/post\/diversity_in_funding_models) , the  [long term future of my career](https:\/\/judahgnewman.com\/#\/post\/a_different_funding_model) , and what  [organization](https:\/\/judahgnewman.com\/#\/post\/substack_limitations_and_dao_possibilities)  I want to be a part of. I want to continue doing that work and thinking about it with other people.\n"],"filename":"2021_in_review"},{"created":1674204883454,"modified":1675332059741,"title":"Stream","status":"In Progress","tags":["meditation"],"blocks":["2\/1\/2023"],"blocks_text":[],"filename":"stream"},{"created":1670833229025,"modified":1675332234594,"title":"Distance on the path","status":"In Progress","tags":["meditation","top_of_mind"],"blocks":["Introduction"],"blocks_text":[],"filename":"distance_on_the_path"},{"created":1675248493996,"modified":1675332284798,"title":"Why does everyone aspire to be a leader","status":"In Progress","tags":["career_decisions"],"blocks":[],"blocks_text":[],"filename":"why_does_everyone_aspire_to_be_a_leader"},{"created":1665641589651,"modified":1675417939231,"title":"Frisbee training","status":"In Progress","tags":["learning"],"blocks":[],"blocks_text":[],"filename":"frisbee_training"},{"created":1675678257438,"modified":1675678856438,"title":"Day Long Joy Retreat","status":"In Progress","tags":["top_of_mind","meditation"],"blocks":["Background Theory - Joy","Background Theory - Branches of Practice ","Background Theory - Experimentation","Background Theory - Building Community","Schedule"],"blocks_text":["\n\n- Meditation is about people able to find joy\n- Part of the reason meditation is taught by having people work on their focus is that unifying your focus is one way to find joy\n\t- flow states \n\n","\n-  [Threefold Training](http:\/\/neuroticgradientdescent.blogspot.com\/2021\/03\/threefold-training.html) \n","\n\n- The goal is try many different things and find what works for you\n\t- This ability to understand what is successful for you is more important than any specific practice\n\n","\n\n","\n\n- Finding Joy exercise\n- Values Excercise\n- Loving Kindness \n\t- Part 1 : Receiving Love\n- Dyads - two conversations\n\t- Introduce yourself\n\t- Something you have been doing recently that has helped you out\n\t- Something you have struggled with\n- Tension Release\n- Afternoon Break\n- Breath Focused Meditation\n-  Group Awareness\n-  Yoga \n- Loving Kindess\n\t- Part 2: Sending Love\n- Debrief\n"],"filename":"day_long_joy_retreat"},{"created":1675704881142,"modified":1675704935659,"title":"Theory of Spaced Repetition","status":"In Progress","tags":["learning"],"blocks":[],"blocks_text":[],"filename":"theory_of_spaced_repetition"},{"created":1675834549473,"modified":1675834951383,"title":"Glyph MVP","status":"In Progress","tags":["top_of_mind","glyph"],"blocks":["Grid Experiment"],"blocks_text":["\nI am interested in the idea that all layout can just be done by using grids. I could build a simple prototype that only focuses on doing response layout. It allows you to create a few different objects and then helps you lay them out on the page. The necessary components would be.\n- An object side bar on the left\n\t- This is where you create objects from. When you create an object you specify which level its at.\n\t- When you create objects that are in the same group they automatically go into the grid layout\n- A canvas with the objects\n- A layout menu on the right\n"],"filename":"glyph_mvp"},{"created":1674115333873,"modified":1675861392530,"title":"Difficulties with traditional buddhist concepts","status":"In Progress","tags":["meditation"],"blocks":["No Self","Emptiness"],"blocks_text":["\n"],"filename":"difficulties_with_traditional_buddhist_concepts"},{"created":1673517402103,"modified":1675870495973,"title":"Bootstraping Fork","status":"In Progress","tags":["career_decisions","organization_structure","top_of_mind"],"blocks":["Fork"],"blocks_text":["\nBeing at Whisper seeing the pressures on Andrew\n1. Andrew does not work on actually building any more, he mostly has to do team management and fundraising\n2. Growth is crazy aggressive, cannot grow at a more modest pace\n3. Do not do a ton of exploration, but rather look to monetize quickly\n\n\nFunding model which has the following properties\n1. Can be done by a smaller group of people, will not require growing the team super large. The founders can still be working day to day\n2. Main goal is not only to make money. Long term what to create a successful product, but can give up revenue\n3. Built with the community, has devoted members who are giving feedback \n4. Easier for new projects to be start up or spun down\n5. Gives the creators space to have a diversity in what they are working on. Can be working on more than one project at a time\n6. Have a long run way. Multiple years. Requires keeping the team small\n7.  Make the organization resillant by having many different sources of funding. One big goal is resillance. Crowd funding is the ultimate resilience. Not dependent on anyone person \n\n---\nCrowdfunding \n\n* really enamored by the idea because of sub stack \n* But most people who are successful either spend a long time building their audience \n* Or bring their audience over from somewhere else. \n* Need enough time and proof to show that you are a good worker \n* Use Twitter for distribution \n\n","\n\n\t* all in on glyph \n\t\t* will require marketing glyph earlier \n\t\t* Reaching out to people who are working on similar projects \n\t\t\t* get some funding from corporations \n\t\t* Making a glyph specific website \n\t\t* Applying to grants \n\t\t* Maybe writing an HCI paper \n\t\t* How far could we get the project on different time scales\n\t\t\t* 3 months \n\t\t\t\t* have a design fully fleshed out \n\t\t\t* 6 months \n\t\t\t\t* have a prototype we can start getting feedback on \n\t\t\t* 1 year \n\t\t\t\t* build a working website people can interact with. Have to upload and download project every time \n\n\n\n\t* Qualitative coding and glyph \n\t\t* glyph gets less far \n\t\t* For qualitative coding spend time working on following things \n\t\t\t* getting the word out about project \n\t\t\t* Building last mile features and infrastructure \n\t\t\t* Deploying something that works for many users b\n\t\t* if successful, glyph can be anything!!! \n\n\n\n","\nStruct is a project that is literally on the exact opposite side of the 2v2 from Glyph. It is quite domain specific and it is a new capability!!! \n\nWhy we are deciding to try and create a child which creates revenue earlier rather than later\n\nWhy we believe this gives us more flexibility than going for crowd funding\n\n* worked a while on micro commons but the framework never seemed right. Especially for early stage projects. The person is both giving you feedback and paying you? It feels like we should be paying the person in equity for just their feedback. We can do that if we have enough money to support ourselves."],"filename":"bootstraping_fork"},{"created":1669628947987,"modified":1676026198930,"title":"My experience with the Jhanas","status":"In Progress","tags":["meditation"],"blocks":["Introduction","How  I first accessed the Jhanas","how my practice continued to develop","My current experience with the Jhanas"],"blocks_text":["\n\n\n- coming off of retreat\n- eating a bagel with Jenny and listening to music\n- hitting it a few more times just sitting around\n\nHow important loving kindness was for my experience. I had basically done none of it, but then started to do it made a big difference. Was really important to find sayings that felt authentic and meaningful to me\n\n","\n\n- the key to being able to hit the Jhanas is to release\n\t- this release is somewhat different than the active focus on the breath\n- Because the key is to release this might be hard for someone people who are used to meditating with trying to cultivate a tight focus. \n\n\n","\n\nKeep growing Piti to reach equanimity"],"filename":"my_experience_with_the_jhanas"},{"created":1674722724119,"modified":1676026239038,"title":"Thoughts on Yoga Classes","status":"In Progress","tags":["physical_activity"],"blocks":["Why I love Yoga","Things that are good about current Yoga Classes","Frustrations with current Yoga classes","If I was a yoga instructor what would I do","My ideal place"],"blocks_text":["\n- They create a container that is separate from everything else. Makes it possible to be really intentional\n- Doing something in a group with other people is super validating\n- Having a regular schedule is really nice\n\n","\n- The teacher not getting to know you. Understand what you want. \n- Not forming a lasting relationship with individual teachers\n- lack of adjustments\n- Teachers not responding to what is happening in the class. \n- not having enough of a wind down at the end\n\n","\n- Make sure to always introduce myself to every student. Ask about them\n- Make an adjustment for every student at some point during the class. Give them feedback\n- Stress figuring out in your own body what a good pose feels like. The ability to check in with yourself\n- Focus on what a pose should feel like, what should be activated, rather than what it should look like\n- For each class not have a set framework for exactly what is going to happen. Have some paths, but still be able to respond\n- Have to make sure you do not burn out the practitioners too early in the class.\n\n","\n- Has three components\n\t- meditation opportunities\n\t- Yoga opportunities\n\t- communal sitting room that serves tea\n- If I was to make something like this it would probably involve a living space too\n- Want to make sure the space is being used for all hours.\n\t- Make sure the space is transformable.\n\t- At night it can feel different then it does during the day\n\t- having a higher utilization rate\n\t-\n"],"filename":"thoughts_on_yoga_classes"},{"created":1668686242735,"modified":1676026320934,"title":"Adoption of meditation","status":"In Progress","tags":["meditation"],"blocks":[],"blocks_text":[],"filename":"adoption_of_meditation"},{"created":1673517153484,"modified":1676026332779,"title":"Realizations","status":"In Progress","tags":["meditation"],"blocks":[],"blocks_text":["\n\nI have been thinking about something we discussed a couple weeks ago and wanted to put down some more coherent thoughts on how my opinion has changed. I basically said that I did not like the concept of enlightenment and mentioned having some aversion to it. I have been reading the end of the Mind Illuminated (the gift that keeps on giving!) and really like Culdasa’s framework for what he calls “Awakening“. He says awakening is the result of having 6 different transformative insight experiences. Using that definition of Enlightenment or “awakening“ feels really precise to me, and makes a ton of sense. \n\nReading TMI I have enjoyed the way Culdasa talks about insight experiences. The map he lays out feels so precise. I do believe that we experience moments of  high neuroplasticity, where we make a realization and our thinking changes afterwards. I remember having the realization in college that free will is not a real thing and that I do not actually have control. I remember the moment so so clearly and after that moment my thinking for sure changed. I really love Culdasa’s idea that in meditation we are building the necessary unity and concentration so that when we have these insight experiences, we are tuned in enough so that they will actually have a large effect. Meditation is increasing our neuroplasticity for these moments. \n\nThis view appeals to me because it does not describe awakening as some final end state to achieve. And once you have achieved that end state you are good. It involves having your understanding of the world be changed through certain experiences. It feels pretty falsifiable and there is still a deepening of practice and understanding that can happen after you are enlightened.\n\nI know Jhourney is about trying to understand the neural correlates of the Jhanas and helping people access Jhanas, but I am also super interested in understanding what is happening during these type of insight experiences. Probably post Jhanas, could you also help someone reach these insight experiences? Is there a correlate for neuroplasticity in general and its all a spectrum or how much do these things have quite different shapes?\n\nJust some weekend morning thoughts for yall. \n\n"],"filename":"realizations"},{"created":1651235728792,"modified":1676026337578,"title":"What are my values","status":"In Progress","tags":["whoami"],"blocks":["Why I am defining my values","Motivating Principles","Daily Principles"],"blocks_text":["\n2. None of us have any purpose. All of life is an incredibly beautiful accident. \n3. Because life is an incredible beautiful accident, we get to decide what we want our purpose to be. There are some constraints, but those constraints are actually a lot smaller than we believe\n4. Many frameworks or purposes can work. It is important for us to have many different frameworks. Different frameworks work for different periods of time and for different individuals.\n5. There is such an abundance of opportunity.\n\t1. Used to be that I was always trying to cut things out. That I had to get rid of things to have more energy. That actually adding more things in can give me more energy\n6. No individual is more important than any others. \n7. Life is a collective endeavor \n\t1. Seeing others suffering directly impacts you. It is natural to be impacted by those around you. In nature ecosystems are reliant on others\n\n","\n\nThe motivating principles help ground and direct my day to day principles\n\n1. Let go of the instinct to control\n\t1. Do not dominate\n\t2. Because there is lots of uncertainty - my perspective is narrow\n\t3. Because my preferred outcome is not necessarily correct - no individual is more important than others\n\t4. I can share my experience or perspective, but should not force it\n2. Understand your context. \n3. You are always practicing something\n4. Find pleasure\n5. Find a balance between exploration and exploitation\n6. Start small and simple\n7. Go slow - Time clarifies\n\n","\n\n\n"],"filename":"what_are_my_values"},{"created":1668617821142,"modified":1676026343247,"title":"Learning from others","status":"In Progress","tags":["learning"],"blocks":["Learning from peers vs Learning from teachers"],"blocks_text":["\n\nThe best way to learn from others is by working with them. Books or podcasts are helpful but it’s not in a direct context of use. Micro commons provides an applied way to learn from others. The application is better then out of context "],"filename":"learning_from_others"},{"created":1654247734040,"modified":1676026364540,"title":"Building skills with knowledge work","status":"In Progress","tags":["learning"],"blocks":[],"blocks_text":[],"filename":"building_skills_with_knowledge_work"},{"created":1651235660087,"modified":1676026373037,"title":"Learning From Peers Rather Than Teachers","status":"In Progress","tags":["learning"],"blocks":[],"blocks_text":[],"filename":"learning_from_peers_rather_than_teachers"},{"created":1658390196086,"modified":1676026476543,"title":"What I don’t like about Basecamp","status":"In Progress","tags":["products"],"blocks":[],"blocks_text":[],"filename":"what_i_don’t_like_about_basecamp"},{"created":1675241813082,"modified":1676026485892,"title":"Products I love","status":"In Progress","tags":["whoami","products"],"blocks":[],"blocks_text":[],"filename":"products_i_love"},{"created":1675834979228,"modified":1676026647335,"title":"What will the impact of Large Language Models be?","status":"In Progress","tags":["top_of_mind"],"blocks":[],"blocks_text":[],"filename":"what_will_the_impact_of_large_language_models_be?"},{"created":1651235424826,"modified":1676026809826,"title":"Human Compatible and EA Movement","status":"In Progress","tags":["looking_forward"],"blocks":[],"blocks_text":["\nA better way to work on AI risk is to work on our relationships today\n- the relationships between humans and animals\n- the relationships between us and others\n\t- prisons\n\t- mental health\n\n","\n\n\nI am pretty convinced very smart ai will be something we can create. There is no reason it shouldn’t be. \n\nWe are only one point on intelligence. There is stuff below us and no reason there shouldn’t be stuff above us. \n\nMisalignment happens everywhere all the time. It happens with humans and other animals. No reason it won’t happen with this intelligence. \n\nFor humans we use checks and balances. Need to do the same with AI. we can work on these checks and balances with existing systems. \n\nFor what happens if it’s way smarter than us. Probably need to fix our relationship with animals first. \n","\n\n\n* Ea movement is super into this\n* read the precipice\n\t* takeaway was just that you should work on ai alignment\n\t* felt kind of intense to me\n* The community indexes on this is so hard\n* decided to read human compatible\n* ***\n* Takeaways\n\t* how do we do future work to combat the harmful impact AI could have\n\t\t* but it is actually already having harmful impact\n\t\t* I think that is where people should be devoting the energy\n\t\t* its not a seperate problem but a very related one\n\t\t\t* currently not enough people working on that\n\t\t* this is more important than long term work and is connected to that long term work\n\t* things are going to be continous\n\t\t* its not going to blow up one day\n\t\t* we are going to make incremental progress on this thing\n\t\t* its not like all of a sudden one day it will be bad\n\t\t* it will continue to get worse and better\n\t\t* but need to ground things in the day to day\n\t* working on a current problem that has the potential to get worse if we don’t work on it now\n\t\t* work on problems we are currently facing while still being future facing\n\t\t* We currently have difficulty proving that an AI system is fair or unbaised. It is actually been shown that you can’t prove this. There is so much complexity involved not in the system itself. If we can’t prove fair, how are we going to prove something, harder beneficial\n\t\t* approach should focus on transparency and tooling \n\t* AI is just a tool like any other\n\t\t* a very powerful one\n\t\t* can be used for good or bad\n\t\t* we forgot that its a tool often\n\t* We need a vision of the future that is desirable\n* ***\n* Such a long term view alienates people and actually hurts the EA community. Narrows the potential audience \n* I worry that this harms the EA communitys ability to have a broad audience\n"],"filename":"human_compatible_and_ea_movement"},{"created":1669047795530,"modified":1676026843014,"title":"Non book Reading Inbox","status":"In Progress","tags":["eka"],"blocks":[],"blocks_text":[],"filename":"non_book_reading_inbox"},{"created":1668590375564,"modified":1676026863105,"title":"Why I eventually want to work on creating new hardware","status":"In Progress","tags":["career_decisions"],"blocks":[],"blocks_text":["\nEmbodied hardware - a computing where you are in an environment and use your full body\n- use your full physical knowledge\n\nBetter ability to understand human neurons \/ neuroscience"],"filename":"why_i_eventually_want_to_work_on_creating_new_hardware"},{"created":1671182773250,"modified":1676026872532,"title":"Tension release","status":"In Progress","tags":["meditation"],"blocks":["Where this idea came from","Practice"],"blocks_text":["\nDo a meditation where you are trying to release different parts of the body\n- can be just head focused or can be kind of like a body scan. \n- Certain parts of the body where there is more difficult or less difficult\n\t- shoulders is a place where it is really natural, but not too hard to apply it to other places\n\n\nEventually just sit, and watch tension arise. Then once tension has arisen, go back and try to relax it\n- interesting for a couple of reasons\n\t- lets me watch the tension arise and notice when tension is arriving and where it is arriving in the body\n\t- trains your nervous system to see that tension and then start relaxing it immediately\n\t- potentially creates a nervous system that does not let tension build up in the same way\n\n"],"filename":"tension_release"},{"created":1674807528499,"modified":1676026883194,"title":"bundles","status":"In Progress","tags":["products"],"blocks":[],"blocks_text":[],"filename":"bundles"},{"created":1666957986749,"modified":1676026967025,"title":"How I want to structure my week","status":"In Progress","tags":["whoami"],"blocks":[],"blocks_text":["\nAnother really important aspect though is being fine when my days do not go to this exact structure. That even when a day goes in a different direction it easy for me to then begin with this structure again. And the days that follow a different structure I still have the ability to be quite present and have a great time for.\n\nSomething I have struggled with is trying to over optimize and then not being robust when those optimizations fall through. I want to make sure I am incredibly robust even when those optimizations do not work out.\n\n","\n\nWhat does my ideal week look like? What does it look like for a lot of people? \n\nMultiple projects. One main and one side. \n\nSocializing, reading and writing. Groups that I am apart of. \n\nBeing physical \n\nTime spent in groups and meeting \n\nGetting to sleep \n\nStart my day off with physical activity and meditation. \nThere is no forcing myself to do anything. If I create the necessary conditions it will naturally happen \n\n\n\nSome mornings start with physical activity followed by sit.\nOthers start with sit followed by writing, physical activity later in the day\n\nYoga Nidra in the afternoon."],"filename":"how_i_want_to_structure_my_week"},{"created":1674715489762,"modified":1676026981500,"title":"prisons","status":"In Progress","tags":["looking_forward"],"blocks":[],"blocks_text":[],"filename":"prisons"},{"created":1671468745324,"modified":1676026996938,"title":"Visionary fictions","status":"In Progress","tags":["looking_forward"],"blocks":["Fiction as a medium for exploration","Story Ideas"],"blocks_text":["\nMost of my writing is in essays. I am trying to explore a point of view and make a case.\n\nFor this type of imigination that I want to build I think Fiction might be a better skill.\n\nFiction also has the benefit of eliciting a different response in the reader\n\n","\n\n\t* prisons abolished \n\t\t* at a personal level we need to re think our relationship to rehabilitation \n\t* climate deaths avoided \n\t\t* group of philanthropists come together for this one. \n\t\t* Combos with charter cities. \n\t* we actually understand the impact and role of sleep \n\t\t* how did this happen \n\t\t* What new tech was invited \n\t\t* How has our understanding changed "],"filename":"visionary_fictions"},{"created":1673987940132,"modified":1676027053205,"title":"Learning through sprints","status":"In Progress","tags":["learning"],"blocks":[],"blocks_text":[],"filename":"learning_through_sprints"},{"created":1675417819295,"modified":1676027109186,"title":"Why Glyph is a visual creation platform","status":"In Progress","tags":["top_of_mind","glyph"],"blocks":["How to improving existing capabilities","Some History ","Graphical Coding Interface","Our contribution to this vision","Measuring our success \/ Goals for our platform","Possible Outcomes"],"blocks_text":["\n\nIf you want to improve upon existing abilities one of the best patterns to do so is change a fundamental assumption. The fundamental assumptions can change, because the creative context has changed!! \n\nGet Examples fro Microcommons websit\n\nOften because it is using fundamental assumptions it will be worse at the exact task, but better at something. It will target a slightly different market or use case. But over time it can expand to be better than the original\n\n","\n\nThere has been a history of new coding languages being created. Languages have moved to higher and higher abstractions meaning the translation that has to be done is a lot less. \n\nDeveloper tooling has exploded\n\nDesign tooling has also blown up recently\n\t- Figma, origami, protopie\n\t- these tools are super widely used\n\t- but still quite limited\n\n package management\n\t* modularity \/ reuse\n* learning curve\n\n","\n\nWhy we think the most important step is to build a graphical coding interface.\n\nIn the past year there has been a lot of excitement about the possibility for AI to improve a lot of our environments. Image generation models like DALLE, Midjourney and Stable Diffusions have given people a test for using AI assisted tooling. Other creators are figuring out how to incorporate interactions with GPT-3 into our workflows. There has been excitement about using AI assisted tools to help with the coding process. An example of this is Github’s copilot which can currently be used to generate code. While we believe using AI to help with the coding process is a really promising direction, I believe that we are not quite there yet. This is something I will be excited to explore, but at a fundamental level think its not quite suited to this context yet.\n\nThe current models are not well suited yet to coding because we have not developed the necessary primitives to facilitate good back and forth collaboration between the human and the machine. For the current models, the way you interact with them is through text. The use cases where it has worked the best are ones where getting the details right does not matter. For a lot of the image generation examples it was fine if some of the details were off. The models are not as good when you need things to be quite specific.\n\nIn creating applications users need the ability to have a lot of fine grained control. To easily move things around. The best interfaces for interacting with AI are going to involve back and forth workflows. The user puts in inputs, suggestions are made and then those suggestions can be edited or adjusted. Which our current interface of text files, that process is not the best one. When Co-pilot generates code it is not immediately clear if we the code it generated is correct. It is also still difficult to know how to edit that code to make it correct\n\n- A different shared representation than current coding languages. Structure makes it easy to communicate. What we are communicating about it a subset of what all language is needed. Notation is more domain specific.  It depends how constrained you want the user to be. Balanace some constraint with less constraint. More constraint can make it easier to learn. \n\n\nGui provides a physical way to manipulate that notation. \n- Gui allows us to benefit from our spatial awareness that we have developed physical movements\n* GUI shows you what options are available to you\n* GUI is used for communicating state of the machine back to you. \n\n[Notational intelligence](https:\/\/thesephist.com\/posts\/notation\/)\n\n> good notation gives us the ability to work work abstract concepts (like sets or infinities) using the same cognitive muscles we use to work with physical objects,\n\n\nFirst, graphical improvements never lead non-gamers to become gamers. Second, intuitive (and typically motion) interactivity does convert this exact demo, even when the graphics are rudimentary (Wii Sports, Guitar Hero, and so on). https:\/\/www.matthewball.vc\/all\/why-vrar-gets-farther-away-as-it-comes-into-focus\n\n","\n\nWith glyph and our projects we are always going to focus on the parts that feel the most under developed with the most opportunity to really change how we are thinking about it \n\nThis is a long term project!!!\n- we want to be doing a lot of experimentation\n- we will have ideas, but it is important we develop a system that allows for experimentation\n- this involves Users and being able to run experiments and get feedback from users\n\t- all products have this need, but I want to be committed to do it so well\n\nProbably we are not going to build a full application in the way framer has\n* at least not at first\n* but we are going to focus on making prototypes that show what you can do\n* and slowly explore those and refine them\n* and add more functionality\n\t* add the more defined things as they are necessary to explore the less defined things\n\nOur target audience to start is people with same coding experience\n\nSpecially we are not trying to compete with other organizations\n* I love the work that Framer and repl.it have done. If they take what we have built and use it that would be such a fantastic outcome actually\n\nThe goal of our work is to show that something greater is actually possible\n\nWe want to focus on the parts of the problems that have not been figured out yet that could be transformative that others are not working on yet \n\n","\n\n1. People can create many different types of things\n2. People can create things quicker\n3. People do not need to leave the platform and access other pieces of information\n4. People do not need to start from scratch but can re-use a lot of things\n\nThese provide success metrics. \n\nWorst case should be equivalent to writing code. \n\n\n","\n* We want glyph to eventually be something that does generate some revenue\n\t* we want the organization to make some revenue children\n- we build something that is a local tool\n\t- eventually spin out the creation of it into something that someone else owns and has investment in\n\n*  the ability to block remixing\n\t* - there is by default the ability for people to remix, edit and extend. You have to pay to remove this functionality\n* people pay to remix\n* people pay for deployment or a high number of users\n\t* only very high number of users\n* people play slightly for URL\n* can always go do these things on their own, but pay a slight service for us to do it for you\n\n---\n\nYou just draw what you want it to look like and then it can create the application for you. \n- does this by picking out the different objects and groups of objects\n- you just then have to fill in some of the control logic\n\t- it shows you the places where you have to fill things in\n- maybe we can influence how you draw. Like is there a certain way we can have you input a sequence of drawings or something\n- Probably best way to do this is have you do it in an iPad app. You start out by drawing and also in your drawing you can paste in default elements so you dont have to draw everything from scratch.\n\nIt gives you places to then fill things in which makes sense "],"filename":"why_glyph_is_a_visual_creation_platform"},{"created":1665649948710,"modified":1676027138443,"title":"Great novel","status":"In Progress","tags":["looking_forward"],"blocks":[],"blocks_text":[],"filename":"great_novel"},{"created":1665659976871,"modified":1676027157698,"title":"Knowledge working drills","status":"In Progress","tags":["learning"],"blocks":[],"blocks_text":["\n\nWatching film \n* Reading other peoples work \n* Watching presentations. \n\nCan do it passively or you can do it really actively. "],"filename":"knowledge_working_drills"},{"created":1651236162856,"modified":1676027177614,"title":"Defining Success for Organization","status":"In Progress","tags":["organization_structure"],"blocks":[],"blocks_text":[],"filename":"defining_success_for_organization"},{"created":1654504291108,"modified":1676027204783,"title":"Mental aspects of athletic performance","status":"Abandoned","tags":["physical_activity"],"blocks":[],"blocks_text":[],"filename":"mental_aspects_of_athletic_performance"},{"created":1669822834791,"modified":1676027224650,"title":"My Reading Lineages","status":"In Progress","tags":["whoami"],"blocks":["#authors "],"blocks_text":[],"filename":"my_reading_lineages"},{"created":1658232729980,"modified":1676027264234,"title":"Bring the research to people","status":"In Progress","tags":["organization_structure"],"blocks":[],"blocks_text":[],"filename":"bring_the_research_to_people"},{"created":1651235779848,"modified":1676027283821,"title":"Humans as AI Alignment Problems","status":"In Progress","tags":["neuro"],"blocks":[],"blocks_text":[],"filename":"humans_as_ai_alignment_problems"},{"created":1668998510492,"modified":1676027784908,"title":"Periph Product Spec","status":"In Progress","tags":["eka"],"blocks":["Moving Away from To Dos","Key Affordances","Core Interface"],"blocks_text":["\n\n- time blocking  \/ scheduling\n\t- schedule **practices** -> things you want to do regularly\n\t- by default there is triaging practices\n\t\t- cleaning up each category in certain ways\n-  breaking down tasks into different categories\n- summarization of information by category\n","\n\nCore interface has some amount of time blocking in it. So there is some amount of scheduling that it has you do\n- doesn’t force you to map directly to a time, but does have you put an order\n\nDivide activities into different categories \n* Reading, writing, coding, designing, projects \n* Let user create their own categories \n* There are certain categories that are there by default and have special functionality backed into them\n* then there is the custom category which you can create and operates in the same way for all custom categories\n\n\nFocus on handling a reading inbox \n* Somewhat regularly forces you to triage. You have added these things, what is actually something you want to return to or not\n\t* Retire, schedule for this week, push a week, push two weeks, push a month \n\nFor each category you have a weekly triage that is scheduled \n\nNeed to strike balance between overly scheduled and feeling constructed and completely free flowing. \n\nSome way to condense categories and then also expand them. Can see a brief summary of them at times. \n\n\n\nDesign Idea:\n- on the left is the info for today. But the main layout is broken out by the categories. Each category has a color. And then gives a little summary of the category. You can click on any category to expand it and get more details.\n- You can click on the day of the week to expand out into the next week\n\t- you can click on a calendar in the top left to go to a different week\n\t- this only shows up when you are in the week view"],"filename":"periph_product_spec"},{"created":1675836007045,"modified":1676028631992,"title":"Updating our beliefs","status":"In Progress","tags":["meditation","top_of_mind"],"blocks":[],"blocks_text":[],"filename":"updating_our_beliefs"},{"created":1665131534194,"modified":1676282333615,"title":"What is Tech","status":"In Progress","tags":["organization_structure"],"blocks":[],"blocks_text":[],"filename":"what_is_tech"},{"created":1676282337160,"modified":1676282693759,"title":"Software Collective","status":"In Progress","tags":["organization_structure"],"blocks":["Extending the metaphor to albums","Extending the metaphor to Record Labels","Looking at Record Labels in game publishing"],"blocks_text":["\nFor musical artists they have a bunch of different projects. They create albums and then move on to the next project. I am kind of curious to extend that framework to my career. I have albums that I am working on. Each album will be slightly different and have a slightly different sound to it. The albums build on top of each other in different ways\n\n","\nFor musical artists previously the record label would handle distribution. You would create the album and then get it bought by some record label. The record label would then handle sending it out to lots of different people. But there were also a lot of artists who formed their own record labels because they could not get an existing record label to sponsor them. This was them working to figure out distribution on their own.\n\n","\nIndie publishing with games is a really interesting place. A lot of the best games are made by indie publishers. There is something similar though with record labels as the major game companies. This one also has a range in it in terms of the different platforms you are creating for. You might be creating for a device or not. \n\nI like what the humble indie bundle did. It was just such a good deal, but it was a way for a bunch of indie developers to come together and get a ton of reach."],"filename":"software_collective"},{"created":1667382860207,"modified":1676282904436,"title":"Different levels of abstraction","status":"In Progress","tags":["glyph"],"blocks":["Why does it feel like this is important to me","How this applies to projects"],"blocks_text":["\n\nLets look at an example with Glyph\n\nGeneral knowledge \nHow we are working and what institutions we are in \nField landscape (what makes a good tool)\nProject vision \nFull application design \nComponent design \nComponent implementation \n\n","\n\n- It helps keep you out of local minimum. Like looking at the higher level of abstraction makes you are collaborated not at a local minimum.\n\n\nMoving levels of abstraction is helpful for the same reason the return is helpful \n* When you come back you have learned 10% more and so your energy can move to harder stuff \n* Working at one level of abstraction helps you have more clarity when you come back to the same level. \n\nThis can be thought a little bit as the move from waterfall to sprint planning \n* The key insight isn’t the exact form, two weeks, retros etc. \n* the key insight is regularly cycling through the abstractions. \n","\nWant to be having a few different projects that you are working on simultaneously.\n- Each project allows you to get feedback and recalibrate and learn. This means there is an important learning cycle.\n\n \n\n"],"filename":"different_levels_of_abstraction"},{"created":1674821882378,"modified":1676283300099,"title":"Miscellaneous ideas","status":"In Progress","tags":["glyph"],"blocks":["User onboarding \/ learning","Deploying the project","Incrematilism"],"blocks_text":["\n\n- all projects are automatically deployed when you start\n- you have two environments production and development. Development is where you work and then you can sync production to dev\n\n","\nCome out of the gate fast let you do anything, but then prompts you to come back and clean up \n\nCome clean up your style sheet or clean up your layout \n\nIt’s kind of like spaced repetition in that way \n\nThe best note takers are people who are constantly going back and re-organizing\n* they are finding the structure of their notes and then returning back to them\n* This helps them keep slotting new notes into an existing organizations, rather than just at the end"],"filename":"miscellaneous_ideas"},{"created":1665131372533,"modified":1676283342484,"title":"Book Tracker","status":"In Progress","tags":["eka"],"blocks":["First Steps","Data Model","Extensions"],"blocks_text":["\n\nInfo I need\n* title\n* status - read or want to read\n* author\n* last accessed\n* list of highlights\n\t* each highlight may or may not have a note associated with it\n* tags  - empty to start\n* rating - empty to start\n\nThen start working on creating the frontend\n- need to add the ability to add a tag\n- need to add the ability to add a rating\n- Add the ability to search a book -> as something I want to read\n- Add the ability to delete highlights\n- Add the ability to add a note\n\n","\n\nAfter books, \n- Then lets do papers\n- then lets do internet reading\n\n\nFor every reading piece, I want to also have things it inspired me to want to read. That connect to to read\n\n\nWith book software a big part of it is connecting it to other ideas. The return for spaced religion isn’t about memorization but about weaving ideas together into cohesive narratives. Integration \n\n\nFor Spaced Repitition \/ time fun text\n* have the ability to easily send something to a later date\n"],"filename":"book_tracker"},{"created":1666113723750,"modified":1676283522011,"title":"How to involve the community","status":"In Progress","tags":["glyph","products","organization_structure"],"blocks":["Why is involving the community important?","What properties should community involvement have?","What does it mean for a piece of feedback to be good?","How to build a platform to do this?","The Impact of outside Influence. "],"blocks_text":["\n- NOT all feedback is equal!!\n\nWant a way for people to get rewarded for good feedback\n\nWant engagement to be high\n\nWant people to feel like their opinion matters\n\n","\nSome ideas\n- Generalizes across many different examples\n- Removes the necessity of some tradeoff.\n\n","\nShould absolutely be using large language models to help facilitate this.\nCould prediction markets be used in some way? Or some idea similar to prediction markets?\n\n","\nWhy there are periods of time when actually you do not want outside influence.\n- Sometimes asking people what they want is not the best solution\n- When you average across too many people you get an average result\n- It is important, essential actually to have periods of time without outside influence.\n\nFor research orgs try to minimize outside influence for a period of time\n\n"],"filename":"how_to_involve_the_community"},{"created":1675834736014,"modified":1676285204086,"title":"Chron Product Feedback","status":"In Progress","tags":["top_of_mind","eka"],"blocks":["Focus Mode","Playgroud","Organizing pieces within a series","Deployment"],"blocks_text":["\n* Once editing is done make an instance where others can start with a blank database \n","\n* Adding some way to see a piece predecessors. Links only go backwards. Show them distinctly \n* this can show a thread within a series\n\n","\n\n- Vercel\n- Render\n- Fly\n- Cloudflare workers "],"filename":"chron_product_feedback"},{"created":1651235365102,"modified":1676290096905,"title":"Assorted Meditation Thoughts","status":"Abandoned","tags":["meditation"],"blocks":[],"blocks_text":["\n\n\n* Using the Path to talk about spiritual journey\n\t* instead focus on balance \n\n* Why does meditation not make you apathetic? If you are happy regardless of condition, then won’t you not try to change anything\n\t* really long term meditations, 12 years\n\t* It is possible that it could, it does not inherently not\n\t* you become more intune with your own suffering and the suffering of others. You want to alleviate the suffering of others\n\t* For the most part its actually just a tool that you use sometimes. You are not always in this condition. \n* Observation: sometimes I have an uncomfortable sensation during meditation. It will go away, but then come back. Its rarely constant\n\t* if it were constant we would get used to it. Instead the change makes it so we are more constantly aware of it. \n* Meditation retreats with other people\n\t* should give more guidance around other people and how to interface with them\n\t* its a very different way of being with people that can be quite jarring\n\t* can feel life reglacting! I struggled with this a lot \n* Returning to the breath and inention setting\n\t* we set the intention and then it happens naturally\n\t* forcing it to happen or hardness does not work\n\t* best way is to set intention and let it naturally happen \n* Meditating and start truly experience all the complexity\n\t* feel the breaths, the sounds, my heart beating, all the sensations\n\t* it becomes so overwhelming that my body feels like it needs to shut it down\n\t* the sheer amount of input that is going into our bodies is crazy complex. So we sample it down a lot and filter out a lot of it\n\t\t* most of the inputs we are not even aware of or putting any energy into \n\t\t* means what we end up seeing is biased or filtered. It will inherently be that way. We cannot experience unfiltered. We need to recognize what we are filtering out\n\nRelease into sensation rather than active focus\nWhen my mind wanders relax\nFloat, release, float ,release\nWander, focus, wander, focus \n"],"filename":"assorted_meditation_thoughts"},{"created":1659600808549,"modified":1676296573384,"title":"INBOX","status":"In Progress","tags":["new writers arc "],"blocks":["#qualitative coding thoughts "],"blocks_text":[],"filename":"inbox"},{"created":1668506628346,"modified":1676301576276,"title":"Meditation in the year of 2022","status":"Finished","tags":["meditation"],"blocks":["Introduction","What Changed this Year","Current State","Advice for New Meditators","Looking Forward"],"blocks_text":["\n\nI have been practicing meditation  for over 5 years since my junior year of college. I began meditating because I felt out of touch with my feelings in a harmful way. I was fairly regularly  disregulated because I was avoiding some difficulties in my life. It felt like every week there was a new crises. Meditation offered a way to help settle down some of that agitation. \n\nWhile the practice has been a part of my life this whole time, this year meditation has became a much more effective tool which has a profound impact on my day to day experience. I now use meditation to support myself in multiple different ways which has contributed to an increase in my overall well being. I now spend minimal time disregulated, I have a lot of energy on a daily basis and I am much more resilient when something unfortunate happens. \n\nDuring these five years I have also spent a lot of energy on understanding what other factors impact my health. I have explored what types of foods I should be eating and when, how I should be scheduling my exercise, what type of exercise to be doing, how much I should be sleeping and many other practices about how to improve my health. While that exploration has led to some insights, it has become clear this year that meditation can have such a profound impact in a way that a lot of these other things do not. \n\nThe expansion of my meditation practice this year has pushed me to understand the practice itself more deeply. I am going to use this writing piece to explore what I did different this year and why it might have moved mr practice forward so much.  I am also interested in exploring what might I have done differently to help my  practice reach a similar place earlier.\n","\nBefore this year, I was interested in going on a meditation retreat, but I was hesitant because I was scared. Meditating for 20 minutes a day was hard enough, what would it be like to meditate for multiple days in a row!? I started off 2022 by going on a meditation retreat at IMS with Jenny. We did a short retreat of only three days which felt more manageable than committing to ten day retreat. Knowing that I was going on the retreat with some one else and that we would have a shared experience made me a lot less scared. I knew there was someone else in the meditation hall that cared for me which made me feel a lot less alone.\n\nTruthfully, going on retreat was really really hard. I struggled with drowsiness everyday. I struggled with physical discomfort. While retreat was quite hard,  it was incredibly important because I was able to find mental states, that I had not accessed before. Later in the retreat, there were moments where I found a very precise focus on my breath which lead to a deep calm. Eating dinner on the last night I had a deep sense of presence with the meal which led to overwhelming contentment. Returning from retreat I had a sense why serious meditators  believe retreat us such a vital part of practice. Retreat is a container to access states of mind that are elusive in our day to day experience. Another benefit  I received from retreat was the sense of accomplishment from completing something that I was scared of. \n\nIn hindsight, it feels like going on retreat layed the groundwork for my practice to deepen this year. Nothing immediately changed in my practice. I still struggled to sit every day, usually only sitting 3-4 times a week. When I did sit, I struggled a lot with physical discomfort and quieting my mind. To keep furthering my practice, I signed up for two day long retreats in April at a retreat center in Boston. My experience at both of these was similar to the longer retreat earlier in the year. I had a fair amount of difficult sitting for such an extended period of time, but also got glimpses into what my practice could look like moving forward. \n\nAround the same time, I  started meeting with my friends Alex and Stephan to discuss meditation weekly. Part of the motivation for meeting with them, was feeling alienated by the Q & A sessions that happened on the retreats I went on. The other people who went on retreats felt like they were in different places with their practice and struggled with different problems. I wanted to have conversations about my practice with people who I felt connected to at a personal level, but also whose lives were in a similar situation to my own. Meeting with Stephen and Alex every week forced me to reflect on my practice. I had to precisely articulate what I was experiencing in my body. Every week I shared what was going well in my practice and what I was struggling with. Not only did this meeting force me to reflect, but Alex and Stephen also gave me advice, connecting my own experience to their practice. \n\nAfter a couple months of meeting with Alex and Stephen I also started increasing the amount I was reading about meditation. Often during our meetings, someone would make a reference to some text they had read. Both Stephen and Alex regularly referred to the Mind Illuminated. During this time period, I made a couple changes to my practice which moved meditating from a chore into something I enjoyed. I stopped sitting in uncomfortable positions and I started reading a little bit about meditation before every sit. Sitting upright in a comfortable chair removed a lot of the physical discomfort that I struggled with while sitting cross legged. Reading passages about meditation before sitting helped increase my motivation and excitement about sitting.  These improvements  made it a lot easier for me to develop a regular practice. Rather than coercing myself to sit everyday, meditation became something that I sought out and actually enjoyed. This made it so much easier to have a daily practice, which in turn made it easier to move further in my practice. It felt like I unlocked some sort of feedback loop that made it easier for me to keep moving forward.\n\nAnother big part of this feedback loop involved the Jhanas. At the beginning of the year I read Leigh’s book about the Jhanas. I am planning to write a whole piece devoted just to my experience with the Jhanas, but accessing the Jhanas helped turn meditation into something that could be a pleasurable experience. This in turn made it easier to sit, which then made it easier for me to enjoy meditation even more. \n\nThe last shift that happened in my practice, came from experimenting with different types of meditations. For the first four years of my practice, almost all of my sits had been quite similar, struggling to focus on my breath. During this year, I started doing lovingkindness on occasion. At first I found lovingkindness meditation to feel somewhat fake or contrived. But as I did the practice more, I have found lovingkindness meditations to be transformative in a different way than breathe focused sits. Through a regular practice, I am actually able to transform my relationships with others and feel so much more love in my everyday life. This has expanded my understanding of what meditation can be. As I mentioned in the intro, a meditation practice can impact my life in many different ways. Different practices have different impacts. Depending on what has been going on in my life, I can pick the practice that feels best suited to deliver what I currently need.\n","\n\n\nAt the end of 2022, the current state of my practice is:\n\t- I sit almost everyday. It is usually the second thing that I do in the day. I do some physical activity first to help me wake up and remove the drowsiness that is there upon immediately waking up.\n\t- Before I formally begin practice, I do about 10-20 minutes of reading from a book about meditation. This helps ground me in why I am sitting and build motivation for the coming practice.\n\t- I sit in a comfortable chair for either 20 or 35 minutes. I start almost every practice with some loving kindness meditation. I normally first practice receiving love from others and then I practice sending love to others.\n\t- After that I try to relax as much as possible and find pleasant sensations in my body. I do not spend a ton of time focusing on my breath, but will use the breath to check in if my mind wanders. When I notice my mind wandering, I try to cue up a feeling of achievement. Every time I notice my mind wandering it is an accomplishment  I am proud of. Rather than returning to the breath, I try to relax and let the breath pop back in.\n\t- If I do encounter drowsiness in my practice I do a small breathing exercise where I breathe aggressively out of my nose quite quickly a few times. This generally removes the drowsiness as I am feeling it and allows me to start noticing it earlier and earlier.\n\t- Once or twice a week I like to sit with some audio stimulus playing.  Generally something from this [YouTube channel](https:\/\/www.youtube.com\/@magnetic_minds)\n\nOver the past year here is what I have read about meditation:\n\t* [Right Concentration](https:\/\/www.amazon.com\/Right-Concentration-Practical-Guide-Jhanas\/dp\/1611802695)\n\t* [The Science of Enlightenment](https:\/\/www.amazon.com\/Science-Enlightenment-How-Meditation-Works-ebook\/dp\/B01KUGQYJO\/ref=sr_1_3?crid=1EZ0FVYEBKX22&keywords=shinzen+young&qid=1670808694&s=books&sprefix=shinzen+young,stripbooks,104&sr=1-3)\n\t* [The Mind Illuminated](https:\/\/www.amazon.com\/Mind-Illuminated-Meditation-Integrating-Mindfulness-ebook\/dp\/B01INMZKAQ\/ref=sr_1_1?crid=NLKAD8FM9JQW&keywords=the+mind+illuminated+by+john+yates&qid=1670808720&s=books&sprefix=the+mind+i,stripbooks,96&sr=1-1)\n\t* [Zen mind, beginners mind](https:\/\/www.amazon.com\/Zen-Mind-Beginners-50th-Anniversary-ebook\/dp\/B086J7X4GV\/ref=sr_1_1?crid=11RL4VGSYHS65&keywords=zen+mind+beginners+mind+by+shunryu+suzuki&qid=1670808778&s=books&sprefix=zen+mind+,stripbooks,92&sr=1-1)\n\t* [Awakening Through Love](https:\/\/www.amazon.com\/Awakening-Through-Love-Unveiling-Goodness\/dp\/0861715373\/ref=sr_1_1?crid=1KPZ8ZBYVLCXQ&keywords=john+makransky&qid=1670808800&s=books&sprefix=jon+mak,stripbooks,102&sr=1-1)\n\t* [Romeo Stevens Blog](http:\/\/neuroticgradientdescent.blogspot.com\/)\n\t* [The Neuroscience of Meditation](https:\/\/opentheory.net\/2018\/12\/the-neuroscience-of-meditation\/)\n\n","\n\nFairly regularly I get asked by friends about advice I have for people who are new to meditation. I know many people who are intrigued by the practice, but struggle with it . They are curious about how to work through difficulties they are having. While this reflection has been centered on my own experience five years into meditation, I actually think there are a lot of lessons that can be applied to help beginners make progress with their practice. Here is a list with some advice I would give to newer practitioners roughly ordered in terms of importance:\n\n* Your primary focus should be on making the practice as enjoyable \/ relaxing as possible. We will always struggle to do something regularly which is unpleasant. Start by blocking off some time everyday to take for yourself. Dedicate a half hour everyday to do something which increases your health. I recommend blocking this time off towards the beginning of the day. At the beginning of the day I have more energy, I have distractors and more likely to stick to the plan. While ideally, this time could be for meditating it really does not have to be. Explore what practices you find make you feel healthy. I think doing some [Yoga Nidra](https:\/\/en.wikipedia.org\/wiki\/Yoga_nidra) could be a good way for some people to start exploring meditative practice.\n\n* As you begin your practice, the most important thing is finding teachers you connect with. There are many different ways to find teachers. You could read some books, go to meditation retreats or attend meditation classes. So many teachers are teaching online now, which has dramatically increased access to high quality meditation instruction. Different types of teachers are going to be best for different individuals so it is important to try out some different teachers and find the way that works best for you! [IMS](https:\/\/www.dharma.org\/) and [Spirit Rock](https:\/\/www.spiritrock.org\/) will both have lists of many teachers\n\n* Continuing in that vain, think about your practice as an opportunity to experiment! There are many different types of meditation practices out there. Different practices will be better suited to some than others. Commit to trying out a practice for a month or so and see how it feels. Notice what you like \/ what feels good about the practice and what you dislike. At the beginning I would say switching to a new practice every month or so seems like a good cadence. It is really important to explore and see what is out there.\n\n* As you are experimenting with different practices, it is important to reflect on which practices you find to be the most meaningful. If you had a sit that felt particularly good, what where the conditions that led to it. Also, if you had a sit that was particularly bad reflect on the conditions that led to it. Using this process of experimentation and reflection you should be able to learn about what helps you have a good practice. I would highly recommend trying to have a peer group that you meet with regularly to talk about the practice. Meeting with friends is fun!! It makes the practice feel a lot less isolated and others often have advice that is quite helpful. Try to find a couple of friends who are also interested and commit to meeting semi regularly to talk about your experience.\n\n* The last thought might be the simplest but also the most important:  the most important determinant of progress is consistency. If you have a regular practice, you will absolutely make progress with the practice. I think it is even possible that there is a feedback loop where the further you get in your practice the easier it will be. The beginning will be the hardest. As you practice more, sitting more will get easier and then it will be easier to have a more consistent practice. \n\n","\nIn this past year, I feel like I have made tremendous progress in my meditation practice, which has had real positive impacts on my life. I am so excited about containing to develop my practice further.  It feels like there is still such opportunity to deepen my practice in many ways. When I was starting my practice, there were topics which advanced meditators talked about which made no sense to me. As I have gotten further in my practice though, some of those things have started to actually make sense. That is exciting, because there are still things more advanced meditators talk about, which I do not understand at all. \n\nLooking forward to the next year I have some things I am really looking forward to. I have two retreats scheduled for this year. Some material related to meditation I am particular excited about consuming this year:\n- [The Heart of the Buddhas Teachings](https:\/\/www.amazon.com\/Heart-Buddhas-Teaching-Transforming-Liberation\/dp\/0767903692)\n- [LovingKindness](https:\/\/www.amazon.com\/Lovingkindness-Revolutionary-Happiness-Shambhala-Library\/dp\/1611806240\/ref=sr_1_1?crid=1W01NCZ8NX441&keywords=lovingkindness&qid=1670810494&s=books&sprefix=lovingkidness,stripbooks,142&sr=1-1)\n- [Vividness](https:\/\/vividness.live\/)\n- [Mastering the Core Teachings of the Buddha](https:\/\/www.amazon.com\/Mastering-Core-Teachings-Buddha-Unusually\/dp\/1911597108)\n- [After the Ecstasy the Laundry](https:\/\/www.amazon.com\/After-Ecstasy-Laundry-Heart-Spiritual\/dp\/0553378295\/ref=sr_1_1?crid=3839129DRPMRW&keywords=after+the+ecstasy,+the+laundry+by+jack+kornfield&qid=1670810659&s=books&sprefix=after+the+e,stripbooks,94&sr=1-1)\n- [Natural great Perfection](https:\/\/www.amazon.com\/Natural-Great-Perfection-Dzogchen-Teachings\/dp\/1559393122)\n- [I Am That](https:\/\/www.amazon.com\/Am-That-Talks-Nisargadatta-Maharaj-dp-8185300534\/dp\/8185300534\/ref=dp_ob_title_bk)\n\n\n\n"],"filename":"meditation_in_the_year_of_2022"},{"created":1671030761333,"modified":1676301580369,"title":"2022 in Review","status":"Finished","tags":["whoami"],"blocks":["Introduction","Finding meaning outside of work","Finding meaning outside of work: Volunteering","Finding meaning outside of work: Frisbee","Reflection on goals for 2022","Goals for 2023"],"blocks_text":["\n\nFrom a solely material view, this year is starting in a similar place to last year. I live in the same location with the same job. In previous years my yearly reflection involved thoughts on a big life change which caused a material shift in my conditions. A big life change once a year felt like a good cadence since I was making an effort to do lots of exploration after graduating from college. I worked at a number of different jobs, lived in different places and took on slightly different lifestyles. These experiences helped me understand what is important to me and how I want to spend my time. Instead of embarking on a new exploration, this past year has been a continuation of trends that I was already thinking about. Looking forward, I am eager to continue deepening existing threads.\n","\n\nA lot of my explorations the past few years have been centered on finding meaning outside of work. At the beginning of my career I tied a lot of my identity to who I was in a work context. There were times where my work dwarfed everything else in my life besides my relationship with Jenny. Over the past couple of years I have been working towards maintaining the meaning I derive from work, while not letting the amount of headspace work takes up become unhealthy.  I began this process in my [[2020 in review]], mostly looking for ways to find distance from work. In my [[2021 in Review]] I narrowed in on the importance of social communities outside of work.\n\nI have learned this year that having a diversity of communities where I find meaning helps me be balanced and healthy by extending my identity. I will have an unbalanced relationship with work, if I connect my sense of worth too directly with it. A healthier relationship is to recognize that my career helps me achieve meaning in some ways, but it is also only one aspect of who I am. While my relationships with family and friends have always been a way to stay balanced, I have gained a lot of value from some additional communities with structure. The book club that I have been in for the past couple years has really blossomed into a sustained community that allows my identity to be grounded in a different context.  Similarly, my meditation group values me for different reasons than my work place. In this piece I am going to touch on two other communities that I joined in the past year which helped keep me balanced. \n","\n\nAfter moving to Boston, I was excited to do some volunteering in my local setting. My work place is still centered in the Bay Area so volunteering is an opportunity to spend time connected to my local surroundings. I was also attracted to volunteering because from my previous experiences volunteering often means being in a setting that is quite different from my usual experience. Volunteering this past year, gave me exposure to environments and individuals who I do not frequently encounter in my day to day.\n\nIn 2022 I volunteered in two different settings:\n- I was a math tutor once a week for a sixth grade student through [Boston Partners in Education](https:\/\/bostonpartners.org\/) at Jackson\/Mann School\n- Over the summer, I tutored once a week for a class at a youth detention center in South Boston through the [Petey Greene Program](https:\/\/www.peteygreene.org\/).\n\nWhile both of these opportunities were tutoring programs most of my role was not about helping a student learn an academic subject. The difficulties these students face are generally not related to their ability to learn. When they were in the correct conditions, they all showed a remarkable ability to understand new material. For most of these students, it was difficult to create the necessary conditions to focus on learning something new. They were in chaotic environments, with many distractions and background worries. Being a good tutor was not about presenting the material in a new way, but being a consistent presence in their lives who would show up, be kind and believe in the students. \n\nA few more short reflections from my interactions with students this year:\n- It seems like students value interacting with individuals that are not present in their everyday environment.  I was an adult figure who did not have any preconceived notions about who the student was. When they met me they had a clean slate and the opportunity to build their identity anew.   \n- 1-1 interactions are really powerful. Since I could devote my full attention to one student at a time, I often was able to understand each learner in some depth. The adults who interact with the students everyday have to divide their attention across many different students at the same time. Because I was able to focus on just one student,  I often had a better understanding of where the student was struggling than the teacher did.\n- The activities we force kids to do are often so rote and mind numbing. Success in traditional schooling is often about the ability to do something tedious. \n- Our current society asks too much from a small segment of the population in helping children develop. So much is asked of teachers and parents. The amount of work they have to do is so overwhelming. Volunteering in a class room is a real help.\n\nVolunteering in these settings once a week was a grounding experience for me. It forced me to travel to parts of Boston I would not otherwise see. Before each session I had to put aside everything going on in my life so that I could be fully present with the students. It felt good that I could connect with the students I was tutoring and support them in some small way. This type of volunteering felt meaningful because I was able to concretely help a community with my presence. The students seemed to enjoy me coming every week and my presence help take some of the burden of the teachers.  \n","\nAfter two years off from frisbee, Jenny and I played the club frisbee season this year. Coming into the season I was conflicted about my relationship with frisbee. Similarly to how my career can take over my life, frisbee has previously taken over my life. I have directly connected my sense of self worth to how I was playing which was unhealthy. Frisbee was also a place where I was constantly comparing myself to others and overly concerned with how others perceived me.  \n\nWhile I still definitely had some struggles this year, in a lot of ways I was able to positively transform my relationship with frisbee. From tryouts through the beginning of the season I was still quite concerned with how others perceived me. Since I was playing frisbee with completely new people, I felt like every playing opportunity was a referendum on who I was on the field. This worry impacted me negatively both on and off the field. When I made a mistake I could spiral a little bit mentally because I thought other people would trust me less. It was also harder to connect with other players because I was worried about their perceptions of me. As the season went on, I learned to identify what playing well feels like in my body and mind. Developing this somatic sense for playing well has the added benefit of helping me understand how to reach that level of performance. This improved ability to evaluate my own play means I am less worried about others perception of my play. I know when I am playing well and when I am not performing as well. Playing frisbee is now less riddled with anxiety about how I am going to perform or how I compare to others. I am able to focus on my excitement to connect with others and to push myself.\n\nAfter the season, I have been reflecting on how much time Frisbee can take up in my life. There are so many ways that I could be spending my time, that it can feel quite costly putting so much of it towards frisbee. For now, I feel like playing a few more seasons and putting more time into becoming a better player is worth it. Frisbee is a microcosm where I can practice being the person that I want to be. Playing a competitive team sport naturally brings out a lot of emotional difficulties. The intensity of these challenges are not as apparent in many of the other environments I am in. While difficult at times, frisbee has been an important source of growth for me. \n\nLooking forward, there are still some challenges I face with frisbee that I am excited to work through. At a personal level, I have yet to become the frisbee player that I know I can be. I have seen glimpses of what it looks like when I am able to put all my skills together, but I am not consistent. Figuring out how to get better at something that I have already put so much time into is a very different task than learning the basics of something new. I am excited to keep figuring out the most meaningful ways to push my game forward. At a communal level, I have never been on a team that feels healthy and supportive for all members. Every team I have been on has brought many different people together to work towards a common goal. This had led to a deep connections. But they have also generally failed to make everyone feel included, to resolve difference and to build mental resilience to difficult circumstances. I am excited about contributing to building a team where everyone feels valued, accepted and motivated together while also supporting us in our differences.\n\nThrough my experiences this past year I have learned the importance of dividing my time, identity, and sense of meaning across a few different communities. Each community values something different in me allowing me to take on different roles. I can be more active in one community at one time and less active at other times. Diversity in my communities has helped increase my overall sense of balance.\n","\n\nBefore looking forward to next year, I want to briefly reflect on my goals for 2022. Looking back, I feel proud of how I spent my time with regards to my goals. I successfully got my drivers license which I thought there was a real chance might never happen! I did the most writing I have done in a year this past year, creating some pieces I am really proud of. With some fits and starts, I have cultivated a spaced repetition practice which has been quite helpful in learning new material. I have also done a ton of work this past year figuring out where I want to go next in my career.\n\nTowards the end of 2022 it has felt like I am hitting a nice groove. I am structuring my days so I spend a lot of time doing what is important to me and that I have a ton of energy. I would also attribute a lot of the success of this past year to the progress in my meditation practice ([[Meditation in the year of 2022]]).\n","\n\nAs I have been working on this piece my thinking about goals has changed a bit. I enjoy the practice of making goals because I find them to be motivating and inspiring. The process of creating goals forces me to reflect on what is important to me and how I want to spend my time. Goals also enable me to be forward facing imagining a point in time where I have accomplished something I am proud of. But, as I have been reflecting, I have also noticed how goals can cause guilt or disappointment. Even though I am incredibly proud of the writing I did in the past year, there is some sense of disappointment from not producing a piece of writing every week like I initially intended. It seems like the danger in goals comes from trying to do too much at once. We are only able to accomplish tasks at a shorter timescale and often our situations change. \n\nIn order to accomplish a goal, I have found it helpful to connect that goal to a consistent behavior such as a weekly or daily habit. Once I have identified the habit, I can narrow my focus. I do not have to worry about doing so much, but can instead focus on what I have to do that week or day. In some ways the goal is no longer important even.  If I am able to consistently do the habit, but not meet the goal, then there was most likely something problematic about the goal. On a day to day basis I will have spent my time in the way that I want to and that is all that I can do. \n\nIt feels important to have both the long term thinking of goals and the short term thinking of habits. The long term thinking allows me to take a broader perspective of everything I could be doing to identify what feels important. The shorter term thinking helps me make day to day decisions. For this year, I am going to name a few goals and then habits connected to them. We will see how this new process works out! I am open to the idea that my longer term thinking should take a different format than goals but this seems like a good place for now. \n\nOne quick thought on habits: For any habit to stick, it is important that I enjoy it. It is difficult to force myself to have an unpleasant experience regularly. With habits like exercising or meditation, once I found a way to make the activity itself enjoyable, then it became easy to stick to the habit. \n\n**Habits to continue**\n- Starting my day off with some sort of short movement (stretching, foam rolling, yoga) followed by meditation practice.\n- Setting aside time 2-3 times a week to do spaced repetition practice directly after lunch\n- Working out for Frisbee 3 times a week (2 lifts and 1 field workout during the offseason) and playing once a week\n\n**Goals \/ Habits that are new for 2023**\n- Build my own writing tool \/  one day each week I work on this project. Have a week long sprint 3-4 times a year.\n- Start learning Chinese  \/ pick one user friendly app and try practicing regularly in the evening\n- Have depth in my non fiction reading \/ do two non fiction reading arcs (neuroscience and open source software) \n- Start writing some visionary fiction \/ Habit TBD\n- Stop working at a company and pursue a more unconventional path to build my career\n"],"filename":"2022_in_review"},{"created":1667115647283,"modified":1676301595724,"title":"Why Microcommons","status":"Finished","tags":["career_decisions","organization_structure"],"blocks":["Introduction","What I am looking for","The necessity of new institutions","How Microcommons reimagines work","What else could I be doing?"],"blocks_text":["\n\nOn the [microcommons website](https:\/\/microcommons.framer.website\/) Holly and I have tried to succinctly articulate the importance of creating a new organization. I wanted to put some additional words down about why Microcommons feels important to me at a personal level. I am going to start by doing a writing exercise I have done before every career change: making an itemized list of what I want in my next opportunity.\n\n","\n\n1. I want to work on an incredibly ambitious project. If the project is successful it will create a large positive impact for many people. The potential of this large impact will be a lasting source of motivation for me. In my previous jobs, I often have had to force myself to do work because I do not feel motivated by the project. Coercing myself to do something that I do not want to feels unhealthy. Of course, there will always be aspects of a projects that I am not excited about. But, using the long term goal of the project as the motivation makes it much easier to do those difficult tasks. I believe that a healthier relationship with my work would come from this type of motivation rather than self coercion. \n\n2.  The vast majority of my time should be spent on the core project. In previous organizations,  so much energy has been devoted to capturing the value that a project creates. Energy is directed away from making a better product and towards growth.  Finding sources of revenue to keep the organization running is important, but it often becomes too large of a focus, drowning out the original aims of the organization.  Similarly, organizations often view growth as a sign of success, growing the size of organization. This leads to lots of energy being spent on coordination in meetings.  While some meetings are important, most meetings are a suck on my energy, preventing me from doing deep work.  Ideally I am spending large chunks of time everyday doing deep work pushing the core project forward.\n\n3. My co-workers should be respectful, kind, joyful and generous. The most unpleasant part of previous experiences has been co-workers who are rude, abrasive and not open to other’s ideas.  I have had coworkers like this at every previous job. It is so demoralizing to work with people like that. \n\t\n4. The project should that push my skill set in a new direction. There are such immense returns in your work output from growing your skill set \/ ability. I both want to become better at the things I am already good at, and try my hand at things which I have not done before.\n\n5. I should be following a path that is different from those who are similar to me. If I do similar things to what others around me are doing, I will probably have similar outcomes.  Trying an unconventional path makes me more likely to discover a way to have a much more positive outcome. I personally am most inspired by people who are brave, following their own unique direction. I should try to follow a similar direction as the people who inspire me the most.  \n\n","\nWhile I believe there are other opportunities that satisfy my requirements, I am particularly excited about what Microcommons could be. It is a first step in re-envisioning the role of *work* in our lives. \n\nSince transitioning from a student to a worker in 2018, I have heard from many peers about work situations which cause them a lot of unhappiness.  They describe experiences where they are treated poorly, do not feel seen and work long hours on uninspiring projects. Since work is the environment that we spend the plurality of our time, these unhappy situations have a large impact on their lives. The suffering that happens at work bleeds over into the rest of their lives, draining their energy and creating a habit of avoidance. Having a better work situation not only impacts that chunk of time, but also has positive impacts on the rest of your life.\n\nTo create better work situations for a large number of people, we need new institutions with different perspectives on work.  While it is currently possible for individuals  to create opportunities that work for themselves, to enact change on a larger scale we need to build communities. An institution \/ community provides validation that a career decision is wise. It is much easier to follow in the foot steps of others than doing something on your own. Most of the jobs where I hear about my peers suffering are ones that where seen as desirable in college. Going to work at these institutions was a straight forward decision though, because many people before them had made the same decision.\n\nFor me, Microcommons is motivated by wanting to create a new structure that encourages people to fully engage their entire selves in a project they find meaningful. Work has the opportunity to be somewhere that people find immense meaning and growth.  Microcommons current structure is Holly and my proposal for creating an environment to build a meaningful project with all of ourselves. I am sure that as we start working on Microcommons we will  need to iterate on what works and what does not. \n\nLong term, I am incredibly excited about the possibility of extending the Microcommons structure to others. I believe Microcommons could be an institution which creates work opportunities which are deeply fulfilling. \n\n","\n\nThere are five important ways Microcommons re-imagines what work could be. None of these are necessarily unique or exclusive to Microcommons, but I believe that combining all of them will create outcomes that are drastically better than what is available today.\n\n1. In our work environment, we should be accountable to a group of peers whom we respect rather than a wealthy individual. Whether it is a non-profit or a for profit company, most work institutions are created by an individual or group of individuals who already have an immense amount of wealth. This group uses their wealth to incentive work on their project. Microcommons in contrast, involves a modest size group of people putting a relatively small portion of their wealth towards funding a small team.  A Microcommons community is not a monolith where everyone is a cog in the machine. It is a smaller group where each steward has real influence. \n\n2. Microcommons creates additional work communities where stewards have the opportunity to contribute and are valued. For most workers, all of their work hours are committed to one community. They spend 40+ hours a week  in the same space with the same people.  I have found that this makes it easy for my identity and sense of self to be very closely tied with this one environment. Microcommons offers an opportunity to be a part of more than just one community. I have personally found that being a part of other environments  besides my main work place is a big boost to my health. Whether it is advising other companies, or volunteering in my community,  more diversity in how I spend my time  has been really meaningful. \n\n3.  Creators in  Microcommons projects have picked a direction that it is well suited to them. Creators will go through a process to explore many different projects. At the end they will select one that is a good match for them. While people currently do put effort into finding work situations that are good matches, Microcommons does this at a more fundamental level. Creators are not constrained by what companies have already been started.  Holly and I went through a multi month phase of exploring different projects areas to determine that Glyph felt right for us.\n\n4. Microcommons believes that small teams over a long time horizon can accomplish an immense amount. Most work institutions grow very large as their ambitions grow. They hire more people believing more people will allow them to do more. While there is logic in this and it is important to have some large institutions, Microcommons wants to create opportunities for small teams to do a lot. Working on a smaller team means less coordination. The team should  be made of personal  that know they work well together and will compliment each other. By committing to a project over a long time horizon the team can be quite ambitious in what they hope to accomplish.\n\n5. Microcommons pushes creators to be continually re-investing in their own growth. Becoming a better worker has such huge returns over an individuals career that it does not make sense how little we invest at getting better at our jobs. Microcommons ensures creators have dedicated time for growing and exploring. \n\nI believe that some of the changes described above are critical for turning work into a space where people find meaning and purpose. Microcommons is only one experiment in re-envisioning what work could be. There are undoudbtely other structures that could also transform the role of work in people’s lives. \n","\n\nBuilding Microcommons to improve the relationship many of us have with work  is incredibly motivating to me. As I have been reflecting on my next career steps, there are other directions that have also been appealing. Below is a list of some other directions that I have considered, ordered from most conventional \/ safe to most uncommon \/  risky.\n\n* Applying to grad school or doing AI safety research\n* Using my technology skills to find a job working in the biology space\n* Training to be a yoga \/ meditation teacher \n* Working in local government. We already know many policies that could have profoundly positive impacts on many. It is less a question of discovering those policies and more about mobilizing the resources to make it happen.\n* Directly working with low income communities in some way. Not trying to build a new organization but joining an organization that is working to make our society more equitable, specifically targeting inequities due to race. \n\nIn terms of safety \/ commonness, Microcommons sits in between number 2 and 3 on that list.  Building Microcommons leverages a lot of the skills I use in my current roles. It also involves interacting with people who are similar to the ones I already interact with. I feel confident that building Microcommons is a better path than the things above it on the list. I am less confident that Microcommons is a better use of my energy than the things below it on the list.\n"],"filename":"why_microcommons"},{"created":1668601961981,"modified":1676301598584,"title":"Who are the people who have done the most good?","status":"Finished","tags":["career_decisions","media_response"],"blocks":["Introduction","The importance of culture shifts","People who might have done the most good"],"blocks_text":["\n\nI recently listened to this [discussion](https:\/\/clearerthinkingpodcast.com\/episode\/118) between Michael Nielsen and Ajeya Cotra about effective altruism. While effective altruism (EA) is an appealing community \/ framework, I have some aversion to their framework. I have [written](https:\/\/repeatedgenerator.netlify.app\/posts\/week_5_impact_and_proximity\/) previously about that aversion coming to the conclusion: \n\n> For my own career, I want to be doing work that has a positive impact but also work that I am proximate to. Being proximate to the impact gives me a better understanding of the impact that I am having. Understanding that impact will help me be better at the work because I can recalibrate my actions as I learn more about what the impact actually is.\n\nI was excited to listen to their conversation because both Nielsen and Cotra are individuals whose work I admire. \n\nNielsen’s aversion to EA seems to stem from believing that there is much more uncertainty about what will cause good. He repeatedly comments about how the the people he admires the most and who he thinks have done incredible good are scientists who were not directly trying to do “the most good“ they could. These scientists were often doing work which was not legible to others and potentially they did not even fully understood how meaningful their work would be.  EA does not advocate support for these types of projects. EA is instead a very community that argues for one particular way of spending your time. Nielsen argues that since there is so much uncertainty in what might be good, this centralization is harmful. Instead individuals should be encouraged to think critically about their careers to find what makes the most self for them.\n\nNielsen’s criticism of the centralization of EA, feels related to my thoughts on proximity. In a centralized framework, there is one person  (or group) making the decision for what everyone should do. This means all individuals, no matter where they start, have to move towards that recommendation. It is not  conducive to individuals looking for what type of work is uniquely situated for them.  While I believe individual EA’s would give you the advice to think critically about your own path, and to find a unique continuation of that path which makes sense, the community as a whole does push slightly different values.\n\nComing away from their conversation, I  have a stronger appreciation for how EA forces individuals to think critically about their careers and their life. While I still have aversion to the certainty with which EA operates and therefore some of the tenets of how, encountering EA has made me think more critically about my life decisions. \n\n","\nThere was one part of their conversation which I have been returning. They started discussing the following question for a brief period of time: \n\n> Who are the people that have done the most good? Where has the most good come from?\n\nI was surprised that both Nielsen and Ajeya struggled to answer this question so much. I was especially surprised that Ajeya struggled since she is someone so immersed in the EA community. EA’s central tenant is trying to understand how to do the most good. A historical evaluation of the different people who have done immense good and how they did that good would be super helpful to answer that question. As far as I know, the EA community has not taken this kind of historical approach though. The community has mostly focused on looking at the situation today and trying to project what will be the most good looking forward. I am sure that the community does a fair amount of including historical perspective into their thinking ([Holden karnofsky does here](https:\/\/www.cold-takes.com\/future-proof-ethics\/)) but it feels like a more in depth and rigorous historical approach would be particularly insightful. \n\nI would absolutely love a historical piece that tries to understand how much good certain historical figures \/ movements caused. What type of role did scientists or corporations or activists or religious figures or artists have. What types of mindsets did the people who did the most good have in common? \n\nWhen I first started thinking about my own answer to this question I jumped to thinking about big cultural shifts that have occurred. During my parents lifetime, there have been some huge cultural shifts which I have caused a lot of good. Things like:\n* \tA large drop in violent crime\n* A large drop in the number of people who smoke cigarettes\n* Many more people thinking about exercise and their diet\n* People becoming vegetarian\n\nI have previously [written](https:\/\/repeatedgenerator.netlify.app\/posts\/week_7_public_opinion_changes\/) about why I believe their is an importance in studying the impact of public opinion changing:\n\n> Some types of changes to our society are predicated on large scale public opinion changes. Without people changing their opinions we are not going to have a more equal distribution of wealth or a more sustainable relationship with the environment. There are instances in history where there has been large changes in public opinion. But also some instances where the change has taken a really long time or maybe still has not happened. Understanding public opinion and how it moves feels under studied. It is a complex topic that does not fit neatly into one of our existing **academic fields**.\n\nIf I believe that immense good has come from shifts in public opinion, then some of the people who have done the most good are those that have contributed to those shifts. Public figures, like artists and novelists who created mass media that helped build a movement to slowly change people’s minds.\n\nThis uncovers another way for me to be thinking about doing good.  I should looking for some possible large scale public opinion changes that could create a much better society. A couple of ones that job out are: \n- a very different view of money and what living a successful live is\n- a very different view of mental health\n- a very different view of our relationship to animals\n- a very different view of our relationship to strangers. \n\n","\nQuick list of people who I believe have probably done a lot of good that do not have EA mindset: \n- Sharon Salzberg, Joseph Goldstein or Jack Kornfield\n- Michael Pollen, Sam Harris or Ezra Klein\n- Barack and Michelle Obama\n- Stewart Brand, Rachel Carson\n\n\n\n\n\n"],"filename":"who_are_the_people_who_have_done_the_most_good?"},{"created":1673018266979,"modified":1676301601055,"title":"Personal Archive Project","status":"Finished","tags":["writing"],"blocks":["Introduction","Frustrations with current tooling","Building this Website"],"blocks_text":["\n\nThe seeds for this project were planted when I was graduating college. I was looking for a way to express myself. I had ideas swirling around in my head but no where to put them. I wanted to write more and also publish my ideas. I was drawn to the idea of starting a blog. I began writing some posts on Medium and explored different structures with my partner Jenny. Here is  [our first post](https:\/\/medium.com\/the-fox-and-the-hedgehog\/why-blog-11a7a0c166ef)  written in 2018 right after we graduated college explaining why we wanted to blog. We proceeded to  [publish a few more posts](https:\/\/medium.com\/the-fox-and-the-hedgehog)  exploring what was on our minds the summer after we graduated. One early theme you can see in these pieces is that we gravitated toward writing about other content we were interacting with. Often the impetus for a piece would be a book that we were reading or a few articles that we had read.\n\nAs we both became busier with full time jobs this blog floated into the background. It became difficult to put together pieces and we mostly stopped writing. It felt like pieces had to be polished and there was a fair amount of friction to even getting started. We had to write using Medium’s tools and on their website. Writing is a really difficult task and any small fractions can be the difference between writing and just letting ideas float away.\nA  [large part of my learning process](https:\/\/judahgnewman.com\/#\/internet_reading)  is reading from other writers on the internet. I admired people who had their own website and would publish frequently. Websites helped develop writers unique styles and build their voices. Simultaneously I started reading academic papers again. I had notes about each paper but they were just being stored locally on my laptop. A website seemed like a nice way to get myself writing again more. I studied computer science, I should be able to create my own website.\n\n","\nCreating my own website connected a lot of different threads. I was withdrawing from social media, deleting all of my accounts and wanting more ownership of my online presence. I also wanted an opportunity to showcase more than just my resume. Applying for jobs is a really difficult process and I felt like any resume could only present a narrow view of who I am. A website provides resources to learn more about me in a deeper way.\nThrough all of my reading I was accumulating a lot of knowledge but was lacking the ability to retain that knowledge or refer back to it. I would read things and then later not be able to find them again. Building a website also seemed like a way to help me retain all of the things I was reading. Both because I would have a written record that I could refer to, but also because it would force me to spend more time writing about what I was reading.\n\nThe first iteration of my website was built using  [Wordpress](https:\/\/wordpress.com\/) . Using Wordpress was a short lived and failed experiment. I had difficulty learning Wordpress’s tools and it felt like there was even more lock in then on Medium. I was constrained by what Wordpress provided and also had to do all of my writing in their tools. After a couple of months I decided to look into static site generators. I found  [Hugo](https:\/\/gohugo.io\/)  and switched my site over in about a day using  [Netlify](https:\/\/www.netlify.com\/)  to handle deployment. One of the nicest things about Hugo is all the  [themes](https:\/\/themes.gohugo.io\/)  that have been developed. Themes make it so easy to create something that looks nice quickly. I used the  [Minimal](https:\/\/themes.gohugo.io\/theme\/minimal\/)  theme and was so much happier about using Hugo rather than Wordpress.\nOne of the downsides of Hugo being so easy to get started with, was that I never really understood the tooling I was using. Each time I wanted to make a change to my website, I was mostly stumbling around trying out different things until something worked. I did not have a strong grasp over CSS and lacked an understanding of how the website was actually wired together. While Hugo was a a good starting place, I found it difficult to make changes, and when I did, not really understanding why they were working.\n\nThere was no real reason for me to leave Hugo though. I had no experience doing front-end development and almost all of the my needs were being met. After reading this  [piece about Machine Learning research](http:\/\/joschu.net\/blog\/opinionated-guide-ml-research.html)  I started keeping a work journal. The first iteration of this work journal was just a different google doc for each month and a new page for each day. While the process of keeping this journal was helpful, I rarely referred back to it. I was allured by the promise of switching my work journal over to  [Roam Research](https:\/\/roamresearch.com\/) . Roam is a tool that is being built for what I wanted to do and Roam promised to make my journaling more accessible. I started taking all of my notes in Roam. Roam was absolutely a better solution but it still presented its own series of problems. My notes had to follow Roam’s bullet point format and all of my notes had to exist in two places, both on Roam and on my website. I would take notes on Roam and then if I wanted to make a post on my website I had to reformat the note and move it into my text editor\nI started thinking about building tooling that allowed me to do everything I wanted in one my place. I want a very low barrier to taking notes. I want all of my notes \/ posts to be searchable and connected. I want to then publish them to my website with minimal lift. I want easily extend my website, add new functionality and change how it looks. As I was expressing these ideas to my friend, he told me to read this  [article](https:\/\/erikwinter.nl\/articles\/2020\/why-i-built-my-own-shitty-static-site-generator\/) . I connected with a lot of the frustrations expressed in that post.\n\nThat post illuminated how our tools impact the way we think. I already knew this to some extent. I have spent a lot of time figuring out my coding set up and optimizing it to improve how I work. But really, my note taking tool and knowledge repository is my most important tool. It is the tool I use the most often and one I am going to use for my entire career. The tool is only going to grow in importance and value the more I use it. It absolutely makes sense for me to optimize this tool for my own use cases.\n\n","\nI decided to build my own website and note taking tool from scratch. I have currently only finished the website part and am still working on the note taking part of it. Building the tool from scratch forced me to learn a lot that I would not have otherwise. I have a much better understanding of CSS and how it interacts with HTML. I learned VueJS and can now build websites or make changes to websites much quicker. When I want to add something to this website it often can be measured in minutes of time rather than days now.\nSo what is this project? I think it can most aptly be described as my personal  [archive](https:\/\/en.wikipedia.org\/wiki\/Archival_science) . This website is both the actual archive itself and the tool that helps me create and maintain my archive.\nFor those interested here is more information about the technical stack of this tool:\n\n* I built the front end using  [Vue](https:\/\/vuejs.org\/) . I picked Vue because it seemed the easiest framework to pick up having not frontend experience.\n* The backend is built using  [Python](https:\/\/www.python.org\/) ,  [Docker](https:\/\/www.docker.com\/)  and  [FastAPI](https:\/\/fastapi.tiangolo.com\/) . These are all tools I have used extensively and know very well. The best part about building this tool myself is that I can use Python to do all the backend.\n* I use the javascript library  [Showdown](https:\/\/github.com\/showdownjs\/showdown)  to parse markdown.\n* I developed my own version of sidenotes based on some code from  [Tufte-CSS](https:\/\/github.com\/edwardtufte\/tufte-css) \n* I use  [Coolors](https:\/\/coolors.co\/)  to create the color scheme.\n* I use  [Goat Counter](https:\/\/www.goatcounter.com\/)  to monitor website usage\n* I use  [Vercel](https:\/\/github.com\/vercel\/vercel)  to handle deployment of the frontend and backend\n"],"filename":"personal_archive_project"},{"created":1675946488663,"modified":1676301603693,"title":"Impact and Proximity","status":"Finished","tags":["career_decisions"],"blocks":["The role of a career"],"blocks_text":["\nI was first faced with ambiguity about the macro direction of my life sophomore year of college. Until then, there was a straightforward path set out for me. I would go through my years of education and then attend the best college that wanted me. There was nothing decided about what I would do after college though. During my sophomore year I had to plan out what my summer would look like. I got an internship which gave a glimpse of what life after graduating could look like.  \n\nBefore that internship when I envisioned my life after college, I used my parents as role models. Their lives were the adult lives that I was most familiar with. It was easy to use their experience as a jumping off point. The post schooling life felt completely different than what I had experienced so far. Picturing something I did not have experience with, I used my most known reference point to guide me. \n\nI pictured my career path in purely practical terms since that is the place both my parents have ended up. They each found their current jobs because they needed a stable source of income to support a family. Their jobs provide them with the means to do what they really care about; raise three boys. I assumed that my career would be similar to theirs. My job would not be something I was really passionate about. I would find meaning in my life through my friends and my family. My career would enabled me to do the other things that were what I found the most meaningful.\n\nThis framing of a job as purely functional changed after my sophomore summer. I worked an office job at a cyber security firm in Chicago. Each day was mind numbing. The office did not have much work for me so I had to find ways to pass the time, while still looking like I was working. I was spending forty hours a week being bored. I was just hoping time would pass me by. When I would get off work, I would not have energy but instead feel completely drained of life.\n\nSince that summer I have put a lot of thought into what I am doing for work. My job is the way I spend most of my waking hours. I want it to be something that is at least stimulating. Hopefully it is something that gives me energy rather than takes it away. I know that there will be some undesirable parts of every job, but that summer felt like a really bad place to be. I was just hoping time would pass as quickly as possible rather than enjoying what I was doing. Every night I would be unhappy faced with going back into the office the next day and doing the same thing. \n\nAfter that, I decided that I would put increased effort into finding a career path that at a minimum was stimulating. During my junior year the topic I was most interested in was [machine learning](\/posts\/week_4_interest_in_ml) and so I put effort into finding work that was related in any way. I spent part of that year and the summer doing ML research for a professor. This time showed me how engaging a job could be. I was excited to work everyday and that left me with even more energy when I left work. It was apparent to me how much better everything was when I was spending my time in a way that felt exciting. \n\n***\nDuring this transition from education to working, I received very little guidance about how to make career decisions. It was not even immediately clear how important of a decision it could be. Picking how I spend the majority of my time is one of the most important decisions I have to make. It is one of the most important decisions anyone has to make. I am lucky and extremely privileged that I have the opportunity to make this decision so strategically. There are so many people in the world who do not have that opportunity. Since I am privileged to have some say in what type of work I do, it is important that I make a decision that is thoughtful.\n\nWhen I make a decision that involves ambiguity and uncertainty, I look to reference points as signal about what I should do. Unfortunately with careers the most tangible reference point is [salary](https:\/\/judahgnewman.com\/#\/post\/diversity_in_funding_models). It is easy to fall into the mindset that a higher paying job is a more desirable one. The other reference point I use is seeing what people around me have done. Whether that is my parents, mentors or my peers, I will use others' decisions as guidance. While this can be helpful, it can also lead to bad decisions if others are different from you. It can also cause bad collective outcomes if everyone is basing their decision on each other.\n\nThe more career decisions I have made, the more I understand the importance of not relying on those reference points as much. This is not easy though, because those reference points are so strong. As I have gotten older it has become evident that part of the reason I studied computer science is because it is a field that others praise and there exists a well known financial payoff. But for me to find meaning and purpose in my work, I have to do the hard task of deeply investigating what is important to me. Hearing other's opinions can be helpful, but I probably rely on them too heavily rather than doing the hard internal work to know what is right for me.\n\nEach job is an opportunity to learn more about myself. Some things can only be learned through experience. I have changed jobs in the past because I learned more about what was important to me. I used those learnings to find a situation where I believed I would be happier. In brief the jumps I have made and what I learned:\n\nI left Nielsen after a year and three months for Change Research\n\t    - Working at a huge company is quite frustrating. There is an intense amount of bureaucracy meaning change happens so slowly.  I wanted to work at a smaller more nimble company. \n\t    - Measuring and improving advertising felt like I was actively causing harm. I was looking for work that felt like it was making a positive impact\n    \nI left Change Research for Whisper after a year and three months\n\t    - I never want to take for granted that what I am doing is beneficial. I should be constantly evaluating the impact of my work.\n\t    - The people you work with on a day to day basis will have the biggest impact on your happiness levels\n\t    - There are so many different problems that it could be stimulating to work on\n***\nI recently, hit the one year anniversary at Whisper and have been reflecting on what I have learned. At one year it feels like, most of the evidence I have collected so far has been confirmed. I am quite happy at Whisper. There are a few great people I work with who keep me happy on a day to day basis. My work centers on measuring hearing aid performance and using that understanding to deliver a better product.\n\nAfter leaving Nielsen, during both my job searches I tried to focus on the impact of the work I was doing. I would talk about how I wanted to be doing work that was impactful. At Change Research, it felt like I was at least theoretically doing the most impactful work I could be. I was helping democrats win elections at a critical junction. At Whisper, I am also doing theoretically impactful work. I am helping people experience better lives by improving their ability to interact with others. \n\nBut with both of these jobs, it still feels like there is something off with regards to impact. If impact is something that is important to me in my career, then I want a stronger understanding of what I am looking for. \n\nImpact is the way that our actions change the world. We are all constantly forming the world around us with our actions. Every action I take has an effect on someone else and their life. When I am nice to someone that impacts their emotional state. When I am frustrated or disgruntled that also impacts others. My job is a place where a lot of my actions take place. The impact of my works is how the actions I take at work change the world around me.\n\nImpact has both a magnitude and a direction. When we take an action the change it causes moves us from one state to another. This new state is different from the old state in some discernible way. It is not always clear what the direction or magnitude is, but we are moving from one place to another. Actions where the new state is further away from the current state have a larger magnitude. Knowing what actions to take depends on a clear picture of what state you want to move toward.\n\nWhile the above is not a perfect framework, we can start using it to help us think about impact. Our impact is made up of all the actions we take. Each action moves the world from one state to another state. Having a large impact means moving the state of the world a lot. Having a positive impact means  moving the world to a state that we believe is more desirable. We do not always know what the impact of our actions is. We can estimate the impact of our actions before taking them and measure the impact afterwards. \n\nMy perception of impact is influenced by how **proximate** I am to it (this idea of [proximate](https:\/\/www.tlu.edu\/news\/bryan-stevenson-get-proximate-on-issues-of-race-and-injustice) is taken from [Bryan Stevenson](https:\/\/onbeing.org\/programs\/bryan-stevenson-finding-the-courage-for-whats-redemptive\/) of [EJI](https:\/\/eji.org\/)). When I am a good partner to Jenny, that impact is incredibly close to me. I am impacting something that touches my day to day life. I definitively know that there is impact happening and can see what that impact causes. When I make a donation to [GiveDirectly](https:\/\/www.givedirectly.org\/) they give money to someone in need. That impact might be large but it is quite distant. I will probably never see the benefits of that donation and there is no way for me to evaluate that the money I donated was actually impactful. I am trusting GiveDirectly and others' (e.g. [Charity Navigator](charitynavigator.org)) evaluation of GiveDirectly. While this might be partly selfish, I feel more moved by impact that I am proximate to. I also have a much higher ability to understand what the impact is. \n***\nUsing the above understanding of impact we can return to how I think about the impact of my own career. It is important for my career to have a positive impact because I believe having a positive impact gives my actions meaning. An important aspect of my impact is my proximity to it. I find it more meaningful to be close to the impact my work is having.\n\nThe importance of being proximate has helped me understand the ways I struggle with the [80,000 hours project](https:\/\/80000hours.org\/). The 80,000 hours project is a part of the [effective altruism](https:\/\/www.effectivealtruism.org\/) movement. They have put a lot of thought into how to have an impactful career. Reading their resources has changed my own thinking and the people there are quite thoughtful. While I feel connected to their overall direction and mission, I felt a disconnect about the type of projects they suggest to work on. They suggest possible paths as [earning to give](https:\/\/www.effectivealtruism.org\/) or working on AGI alignment. While both of these paths might have a large positive impact, you will be quite far away from that impact. When you spend your time earning as much money as you can to donate it, the impact you are having is quite far from the way you spend your time. We are still so far away from AGI, that work on AI alignment is not proximate with our every day experiences. \n\nFor my own career, I want to be doing work that has a positive impact but also work that I am proximate to. Being proximate to the impact gives me a better understanding of the impact that I am having. Understanding that impact will help me be better at the work because I can recalibrate my actions as I learn more about what the impact actually is.\n\nTo find this type of work, I  need to focus on things I am already proximate to or become more proximate to things that will have a positive impact. I am really motivated to work on problems related to [creating novel organizations](https:\/\/judahgnewman.com\/#\/post\/a_different_funding_model) because I have so much first hand experience with how organizational structure impacts what is created. If I believe some type of work could be impactful, then it is important for me to become proximate to it. For example, When I donate money to charities, I mostly focus on giving to organizations that work in developing countries. Developing countries have many more people living in poverty. Improving living conditions for someone who has a more difficult life can often be a larger change. If I truly believe that I can have the largest impact by improving living conditions in developing countries, then it is important for me to become proximate to that issue by moving to a developing country.\n\nPart of the difficulty I am having with impact of my career might be related to being a software engineer. This does not have to be the case, but most software engineers are not proximate to the impact of their work. I spend my time coding and then someone quite distant from me is eventually impacted. Tech companies do try to understand their impact through data, but even that data leaves developers at quite a distance. They are not connected with the people who are being impacted. Understanding the importance of being proximate means that I should find ways at work to get closer to my impact. \n***\n\nThis reflection helps me understand what I mean by trying to find work that is impactful. I want to take actions that help move the world to a better state. I want to be proximate to the impact I am having because it allows me to actually see what that impact is. At my current job I should try to become more proximate to the impact of my work.\n\nIf I truly believe that the largest impact I can have is by improving living conditions in developing countries, then I should move to a developing country and find work there. Trying to do that type of work from a distance does not make sense.\n"],"filename":"impact_and_proximity"},{"created":1666792979792,"modified":1676301606547,"title":"Picking my next project","status":"Finished","tags":["glyph","career_decisions"],"blocks":["Building Depth","Our creative history and creative future","Wide vs Deep Spectrum","Novel vs Ease Tradeoff","Understanding My Influence ","Emotional resonance - Changing our relationship to software","Backcasting for Emotional Resonance"],"blocks_text":["\n\nAs I mentioned in my [[2022 in Review]] my career decisions so far have been focused on exploration. I have worked at a few different companies each time in a slightly different role. I have done data science, software engineering and data engineering in advertising, public opinion and consumer hardware. Each experience helped me learn about the type of work environment I like. They also taught me a lot about what I disliked! In [[Why Microcommons]] I explore the qualities I want my work container to have. That piece focused on how I want to work rather than what I work on.  In this piece I am going to delve into what I want the contents of my next project to be. \n\nI have found picking a particular domain for a project to be challenging because there are so many different areas that I could be interested in. None of my previous jobs were in areas that I found to be extremely attractive but there were dynamic and exciting problems in all of them. Since I have previously felt relatively domain agnostic I have spent more time thinking about how I want to work rather than what I want to work on. As I look forward to picking my own project to work on though, it is important I put some thought into picking a domain that I will be excited about for an extended period of time. \n\nPicking a domain that feels compelling to me is particularly important because I want to be working on this next project for a more extended period of time than a couple of years. Because I have only stayed at each previous job for two years or less, I have not built a ton of depth in any specific domain. Regularly switching to new domains helped me develop a wide range of skills and forced me to learn how to ramp up in a new space quickly. But now I am interested in trying to build depth in a domain that I find particularly compelling. I am excited about building depth in one domain because I believe that certain types of contributions require deep understanding that is only possible from exploring that domain extensively.\n\nIn particular, I am interested in a project that aims to make a contribution in an area that many individuals have previously worked on. For example, many people have spent their time working on the basics of physics or mathematics. In order to continue pushing those fields forward it is necessary to have extensive domain knowledge to work at the cutting edge. In the rest of this piece I outline my thinking about why building this depth is important for the project I am interested it.  \n","\nAs I have been thinking about my next project a core question I am pondering is **“How to understand any projects’s impact?“**. This question is not one with a definitive correct answer. There are many different lenses that could be used to understand how a project affects our lives. Nevertheless, trying to answer this question is essential because it enables us to compare potential projects. Our framework for answering this question can be used to help determine if one project is a better use of our time than another. \n\nOne possible answer that I am currently finding helpful is to measure a project’s impact by **how it changes what other projects are subsequently worked on**. This framing is inspired by [Michael Nielsen’s musing](https:\/\/scienceplusplus.org\/cusc\/index.html#fn19) about how important discoveries in physics are used in future work. When a truly impactful discovery is made, it has a drastic impact on which projects are pursued afterwards. The projects that are pursued afterward will use that work as a given and then extend it or use it in another work. \n\nTo formalize this idea, we can say that every project is a function of the ***creative history*** at its moment of origination. The creative history is a bundle of all projects that have preceded it.  Every project is only possible because of the projects that have come before it. For example, most software companies starting today are only possible because of the creation of cloud computing. Cloud computing gives teams the necessary computing resources to build software. We can understand the impact of cloud computing by how it has changed which subsequent projects are started. \n\nA project’s impact is not only how it gets used in other projects but also how it influences or inspires derivative work. While cloud computing is a straightforward example of how a project might enable other projects, it might be illustrative to consider another project that is not directly used by other projects. While there are not a lot of projects that are using Uber as a core technology, Uber has enabled derivative projects in many ways. Post Uber, many projects have tried to apply a similar model of increasing the utilization of latent resources by creating a new market in other areas. Uber also made it more likely for future projects to focus on improving the transportation sector. People see that Uber was able to achieve success in the field of transportation and this makes them more likely to tackle projects in a similar space.  A project changes what future projects are possible not only by how it is used, but how the project inspires others.\n\nWhen considering potential projects we can imagine how they might change our  **creative future**. When I first started this piece I was trying to develop a framework based on characterizing certain projects as *infrastructure*. In my head, an infrastructure project is one that directly enables others to do more. Examples of infrastructure projects would be things like cloud computing, the printing press, video editors, coding languages. I was struggling though to define the characteristics of an infrastructure project. I was unable to article which projects where infrastructure projects and which ones were not. This is because all projects, even ones that are quite narrow and specific change what types of future projects might be started. \n","\nUsing this framework we can compare potential projects by how they might update our **creative future**.  I have found two different spectrums helpful for giving structure to how a project might influence future work.\n\n1. Updates to our creative future may apply to many projects or a small subset of projects (wide vs deep)\n\nSome projects will enable many different types of derivative projects and other projects will greatly accelerate a narrow set of projects. For example, let’s compare the impact of a CRM like Hubspot with the creation of a productivity tool like Notion. Hubspot helps enable projects that involve managing relationships with many different entities. For projects of this nature, Hubspot makes relationship management and tracking a lot easier allowing the project to focus their energy in other ways. Notion on the other hand has the potential to help the broad category of projects that involve transferring knowledge between people. Thats basically every project out there!\n\nComparing Hubspot and Notion shows that there is a tradeoff between trying to have a deep impact vs a wide impact. While Hubspot is only applicable to a smaller set of projects, for these types of projects Hubspot is quite helpful.  Notion on the other hand can help almost any project out there, but it will move the needle much less for each of those projects. Notion helps with knowledge management and organization, but it is not directly facilitating any specific project. \n\nAnother way to frame this spectrum might be to think of it in terms of specificity to generality. Hubspot is able to have a large impact by crafting their solution to specific instances. They know exactly the use cases they are building for and do not have to worry about applying to other situations.  Notion on the other hand has to make a solution that generalizes across many different instances. This generalization requires finding a commonality across many different areas rather than being grounded in just a few specific examples.\n\n","\n2. Updates to our creative future may enable new projects or ease existing projects (novel vs ease)\n\nSome projects will enable projects that were not previously possible while others are more likely to make projects that are currently possible today easier. To understand this spectrum we can compare building a quantum computer with a project like [Arc](https:\/\/thebrowser.company\/) which is creating a new web browser. Building a quantum computer will enable projects that are currently impossible. Once a quantum computer is built we will be able to do all sorts of computation that is currently impossible. Arc on the other hand is not directly enabling  any new  projects. Instead by creating a better browsing experience it is making the internet easier to utilize.\n\nProjects in different places on this spectrum face different difficulties. Projects which are directly enabling novel projects are less grounded in existing use cases. It is less clear exactly how they are going to update our creative future because we have a worse sense of what derivative projects might look like. It is easier to wrap our heads around how making existing projects easier might impact our creativity. But these projects face the challenge of already having an alternative solution in place. While it is easier to understand how Arc might improve a current project, they have a larger burden of showing how they are better than what already exists. This can be quite difficult because there is a switching cost which can be compounded by network effects. It is often important that many people are using the same solution so to get many people to switch to something new requires quite a large improvement. Quantum computing on the other hand is enabling what was previously impossible so they do not have competition in the same way.\n\nWhile using this uni-dimensional spectrum as a framework is helpful, I want to briefly acknowledge that it is an oversimplification. Often by making existing projects easier, new types of projects become possible.  New projects might start happening because making something easier has increased the accessibility of this project. Now because more people are tackling a project and they have more time available projects will start taking a different form. While I think this spectrum is still helpful, it can be murky to place a project on it. \n \n","\nIn the previous sections I have talked through some frameworks we can use to asses what the potential impact of a project might be. These spectrums give us a starting point for comparing different projects. Before using this framework, it also feels important to bring a perspective focused on the individuals working on the project. Projects do not exist independent from the people who work on them. Each project is intrinsically tied to the people who are working on it. For any project it is important to understand who those people are. For my own projects, it is important to connect any project to my understanding of self.\n\nAt a personal level, I believe the best use of my time is to work on projects that might be undervalued by others who are similar to me. Truthfully, there are so many people out there that have similar skillsets and backgrounds to me. People who went to an “elite“ academic institution, have worked on tech projects and have built software related skillsets. While I am absolutely drawn to working on climate related problems or problems in artificial intelligence, there are already so many people working in those spaces. Adding my time to that group of people is less likely to be as meaningful as spending my time in a domain that others are not as actively working on. \n\nWe can combine my interest in working on a project that is not valued highly by others with the two spectrums from earlier, to help identify what type of projects might be undervalued by others. Without doing an extensive analysis of all projects out there, my gut is that projects tend to be more  deep than general and more focused on novel creation than easing existing creation. As I discussed earlier focusing on a more narrow space is often easier because you are grounded in specific use cases. What you build does not have to generalize as broadly. On the other spectrum, building something that is more novel feels like an easier sell since it does not have to directly compete with something that exists.  Intuitively, it feels like more projects are narrowly focused on delivering a novel capability than more broadly focused on improving an existing capability. \n\nIf I want to be working on a project that is undervalued by others, I should be thinking about projects that look to have quite a wide impact by improving an existing capability. \n","\nWhile using logical reasoning to help constrain the type of project I want to work is helpful, the most important part of actually picking a project is finding something that emotionally resonates. I want a project that gives me a spark. A project that will keep me excited and give me energy. Finding a project that emotionally resonants is a huge advantage. That emotional connection will keep me motivated even when difficulties arise as they do with all projects.\n\nThe project area that sparked emotional resonance for me is changing our relationship to software. This project jumped out when I was reading [Where Wizards Stay up Late](https:\/\/www.amazon.com\/dp\/B000FC0WP6).  As I was reading about some of the engineers who helped develop the internet, it was so stark how different their relationship with technology was with what I experience today. All the engineers were constantly updating and editing their technology to fit their own needs and use cases. If they had an idea about how to improve a certain piece of software, they would make that change. If others also liked the change that they made, they would use it as well. My relationship to software on the other hand is one where I lack control. I can pick between a few different choices, but all the software I use is created by someone else and made for an average user. This is the case even though I am a software engineer! I spend all my time working on creating software and yet I have minimal control over all the software that I use everyday.  I find it incredibly exciting to think about having a similar relationship to software that the engineers in the book had.\n\nA project that focuses on changing our relationship to software through an improved ability to create and edit software is a project that meets all of my criteria. There are so many different projects that are centered on building and using software. Improving our ability to create software is something that is quite broadly applicable too many potential derivative projects. It is also a project which is not centered on creating some novel capability. We already have the ability to do a lot of these things, but it is about making it easier and more accessible.\n","\nIn this piece I have walked through my process to determine what project I want to work on next. I started by developing a small framework to help compare projects with each other. I then combined that framework with my some of my own opinions to narrow in on which types of projects feel like the best fit. Lastly, I used emotional connection as a guiding way to find which project in particular called out to me. I want to end this piece with some thoughts on how I understand emotional resonance and a method that can help find emotional resonance.\n\nIn a previous piece I have discussed how I believe emotional resonance is connected to the things we are proximate to ([[Impact and Proximity]]). We are more likely to feel connected to something that we experience every day of our lives. I feel strongly about improving our ability to create software because I spent most of my days working on creating software. I spend so much of time writing code and trying to building different tools. Not only that, but I spend a lot of time using software. I think a lot about the impacts that the tools I use have on me. This project of improving our ability to control the software we use will have a drastic impact on my day to day. This does not mean that every project I work on has to have a connection to my everyday experience. But often that is a good way to find emotional resonance. If you want to work on a project that is not connected to your day to day, it might be a good idea to find ways to become proximate to that topic.\n\nI have found one of the most effective tools for finding emotional resonance is to imagine potential futures where my project is outrageously successful. I think this process of envisioning a future world is not only helpful for finding emotional connection, but also a useful tool for working on a project. For this project of changing our relationship with software, I am envisioning a future where everyone create their own software. Each person has thought about their own needs and what environments they want to be. They have taken existing software and adjusted it to fit their own uses cases. Each piece of software is personalized to person that is using it. This shift also has made software creation dramatically more accessible for the population and created economic opportunity for many individuals. People who have remixed software in compelling ways have been able to profit from their work of creating a solution that works for them. For more examples of backcasting see the vignettes we wrote on the Microcommons website related to each project ([glyph](https:\/\/microcommons.framer.website\/glyph), [unilink](https:\/\/microcommons.framer.website\/unilink), [phenom](https:\/\/microcommons.framer.website\/phenom), [II ed](https:\/\/microcommons.framer.website\/iied))\n\nEvery project that we take on involves using our time and resources to have an impact on the world. Each project changes what other types of projects people work on. For my next project I am incredibly motivated about changing the relationship that we have to software. I can envision in a world where everyone plays a more active role in crafting their digital environment. For any project it can be helpful to envision what future world we want to create. That future world can be used as a consistent source of motivation and a guiding force when making decisions.\n"],"filename":"picking_my_next_project"},{"created":1673019325764,"modified":1676301609174,"title":"Writing Process","status":"Finished","tags":["writing"],"blocks":["How environment impacts behaviors"],"blocks_text":["\nWhen I travel to new places my energy level is always quite high. When I wake up in a different city, I want my day to start as soon as possible. I am pulled out of bed by all the exciting things that I want to do. This energy is not specific to activities in that place. I have more energy to work out, write or read. When I am at home, sometimes I have that same energy, but it can be hard to recreate. There is not the same sense of urgency or excitement. While I wish I could always achieve that same energy at home, it might be a little bit unrealistic.\n\nOur surroundings and stimuli have such an impact on our mental state. The difference in energy when I am traveling is only one example of this. Even really small changes can cause quite the difference. After I buy a new pair of running shoes, I am more likely to go on a run. When I have a nice kitchen and tools I am more motivated to cook. The environment that we are in can make all the difference in terms of what we do. \n\nThis impact of our environment on behavior extends to all parts of our experience. It directly impacts the thoughts we have and what actions we take. This is why some people say [you are the sum of the people you surround yourself with](https:\/\/blog.samaltman.com\/the-days-are-long-but-the-decades-are-short). This is why writing can actually force you to have different thoughts than if you are in a conversation. Using a tool like [Roam](https:\/\/roamresearch.com\/) which forces the usage of bullet points can actually change what you create. It is important to make intentional decisions about what our environment looks like and what tools we use because of how large their impact can be. \n\nPart of me is scared when I notice how much my thoughts and actions are determined by the external. Another part of me wants to use this to help accomplish certain tasks. I am scared because I want to be resilient to external factors. Even if I have bad tools, I want to still accomplish difficult tasks. I do not want to be so dependent on having the exact correct situation. Working to be more resilient is important. I also recognize the impact my environment can have. Making conscience choices about my environment feels especially important when I am trying to do something hard. \n\n***\nI not only want to improve my writing, but to understand how to regularly do something that I find hard. The type of writing that I am trying to do in this project is quite labor intensive for me. This endeavor is partly about learning how to create systems and practices that facilitate this difficult task. What I learn about how to make writing easier might apply to other tasks I struggle with. Part of the goal is also to become resilient so I am less dependent on having a perfect situation with no distractions.\n\nI spend a lot of time pondering how I can improve my ability to accomplish things that I value. Often these conversations center on how to improve my work life or to spend more time making progress on projects. Last fall I had a discussion with researcher [Andy Matuschuk](https:\/\/andymatuschak.org\/) about my pain points in that process and how I want to get better. After that conversation I honed in on the idea of better [attention allocation](https:\/\/judahgnewman.com\/#\/post\/project_intro). The core idea of that post is that I want to direct my energy towards meaningful tasks that are important to me. While that idea still resonates with me, the scope is probably too large. \n\nThis project centers on how can I do one thing; generating novel insight \/ clarity of thought which I can share with others. Rather than determining how I allocate all of my energy, I am prioritizing some of my energy towards doing one thing which is difficult and important. Learning how to allocate my energy once, will also teach me lessons about how to do it in general. \n\nWithout some structure or goals it is difficult to evaluate how I am doing. Without stressors and deadlines it is hard to evaluate what makes a good system. The stress lets you see the weak points and where it can be improved. This project with weekly deadlines forces me to look at the writing process frequently and critically.\n\n***\nA necessary part of improving my writing process is understanding it better.  When I understand the different components it is easier to identify what impacts my ability to make progress.  Breaking down my writing process into a few different steps is a helpful abstraction: \n\n**Step 1: The Spark** The first step is when an idea is generated. This does not happen siting in front of my laptop when I am trying to write. It happens when I am doing other things. When I am talking to a friend, when I am in the shower, on a walk, meditating. \n\n**Step 2: Gathering Wood** Now that I have a spark, I want to build a fire. This step involves collecting other ideas that connect to the spark. What else have I been thinking about that relates to this initial idea. How can this one idea build into a more cohesive piece? \n\n**Step 3: Building the Log Cabin** Once all of the wood is gathered it needs to be arranged into a general structure. All the ideas are arranged into a coherent structure. This is when I outline the structure of the piece \n\n**Step 4: Light it up**  Now that we have an outline, it is time to fill in all the detail. Hopefully everything catches fire, but some parts might not. Filling in an outline with text feels very similar to the way a log cabin gets engulfed in flames\n\n**Step 5: Managing the fire** Most of the hard work is done but things still need to be adjusted occasionally to keep the fire burning. We need to make edits and revisions. Occasionally this will be more substantial and sometimes it will just be small movements.\n\nUsing the stages of the writing process it is easier to pinpoint where my own difficulties with writing arise.\n\n- Steps 1 and 2 are currently my favorite parts of the writing process. I have no shortage of ideas. It is fun to then look at those ideas and connect them with each other. If anything I generate at ideas at such a fast rate that it can be difficult to manage all of them.\n- Step 3 is a place where I struggle quite a bit. I often skip that step or only do a half hearted job at it. I especially struggle with it when the ideas are disorganized already.\n- How step 4 goes is dependent on step 3. When step 3 goes well then 4 is quite easy. When I skip 3 or do a bad job at outlining then 4 can be a real struggle. The other difficult part is that while I have represented it as a linear process, it is not always such. Sometimes as I am doing step 4, I should really stop and do more outlining. As I start doing all the filling in, a clearer picture about the structure also forms. \n\n***\nHaving a goal for what my writing process should look like is helpful. Once I know what the current state is and what I want to future state to be, it becomes a lot more actionable to improve my process.\n\nIn order to create good pieces, there are a few properties that I want my process to have\n- I want to be working on pieces over a long period of time. Good writing takes a long time. I rarely want the ideas for a piece to develop in only a week. I want pieces to be iterated on for extended periods. \n- Over that extended period I want to touch the pieces frequently. When I am touching them frequently I will be thinking about them even when I am not at my desk writing. This type of thinking often leads to the best insights.\n- When the structure of a piece is good, finishing it up and filling it out is easy. When the structure is wrong, it is almost impossible. I want a process that helps me find the right structures. It should be flexible so I can switch to different structures easily when I find something is not working\n- When the space of possible things I could be working on is really large I gravitate to working on the easiest and most defined task. It can be helpful to have enforced structure that makes me do the harder things. This takes away the mental burden of having to decide what to do. \n\nWith these goals in mind, here is my current writing process:\n- Sparks get generated constantly. Whenever I have a spark I try to either write about it in my [remarkable](https:\/\/remarkable.com\/) or on my phone's notes app. This is a solid way to chronicle initial thoughts that is not too disruptive to my day-to-day. \n- During the week I spend one [pomodoro](https:\/\/en.wikipedia.org\/wiki\/Pomodoro_Technique) every day writing. I find that earlier in the day I have a larger capacity for accomplishing hard tasks. My first pomodoro of the day is devoted to this project and writing. Right before sitting down at my laptop, I meditate.\n- All of my writing work is currently done in Roam. I have one page that contains my writing notes. When I have decided I have some ideas that I want to be a piece, I turn them into a sub page. I also have a page with all of my sparks that are not fleshed out so I am still unsure if I want them to be a piece. \n- Each day I have a defined writing task\n    - Monday: Take all my sparks from my phone's notes and my remarkable. Move them to Roam. Look at sparks and see if any feel really exciting. If so start connecting ideas. \n    - Tuesday: Outline the piece that I want to publish at the end of that week\n    - Wednesday: Flesh out ideas on a couple pieces further in the future. \n    - Thursday: Fill out details for the piece this week. Goal is just to write and get ideas out. I try not to care about sentence quality.\n    - Friday: Start by reviewing the piece's structure. Make any changes if necessary. Finish getting all ideas out and start revising.\n    - Saturday: Off\n    - Sunday: Edit piece for week. Do two read throughs. Then publish\n\nThis current process means I am spending 3-4 hours a week. 2 Days I am working on pieces for future weeks and 4 days I am working on the piece for that week.\n\n***\nPart of why I turned this into a new project and made it separate from my other website is because it gave this project a new energy. The process I outlined above seems to be working well but I am sure there are opportunities for improvement. \n\nI am interested in exploring if better tools could help facilitate this process better. As I keep writing I want to identify the biggest pain points and how I might improve them. If building my own tools that are optimized for my process would have a large pay off then that is something I will try to do. \n\nA few ideas about what I would do if I built a tool:\n- Currently I have to spend time transferring my sparks into Roam. It would be nice if they just were there and organized. \n- Similarly, my page of sparks is quite long and disorganized. I could imagine something that manages sparks for you. It would resurface sparks at planned intervals or let me sample randomly from sparks. \n- I like Roam's editor for writing because it makes it really easy to drag snippets around. As I learn more about how I write, it could be worthwhile to build a custom text editor that forces certain structures and has affordances that align with what I want to do. \n"],"filename":"writing_process"},{"created":1651235454458,"modified":1676301611854,"title":"Writing Process Updates","status":"Finished","tags":["writing"],"blocks":["Project Update"],"blocks_text":["\n[[Repeated Generator]] is motivated by using a writing practice to help make me a sharper thinker. Setting aside time each week to write in a way that is understandable to others helps tighten my ideas. It is also motivated by a future where I have developed a body of work that I can refer back to and which can be shared with others. \n\nFour months into the year, I have published more writing about novel ideas than in any previous year. But I also have struggled to consistently publish pieces. The pieces I have published are quite long, taking a lot of time to complete. Finishing a piece every week requires spending a sizable amount of time working over the weekend. As my weekends have started being filled with other activities, I have struggled to continue publishing pieces. Now feels like a good opportunity to take stock of how this project is going and to make any adjustments that feel necessary.\n\nThe most successful part of this project has been my how I am developing ideas. I have notes and notes filled with topics that I want to explore more deeply through writing. Most of my ideas are sparked away from the laptop when I am reading, on a walk or listening to a podcast. Having one place where I deposit all of these ideas has given me the ability to see themes in my thinking.\n\nTurning those sparks, which are normally a few sentence fragments, into a published piece has still been quite difficult. As I begin writing the scope of what I want to discuss balloons. Pieces with a large scope are difficult to organize in a coherent manner.  The larger the piece, the more editing and revising that is necessary. \n\nFor me to maintain a consistent writing practice, I have to derive joy from the practice rather than seeing it as a task that I force myself to do because it is good for me. I aspire for writing to feel the same as reading fiction on my kindle. A relaxing activity that gives me more energy than I had when I started. There are three aspects of the writing process where some mental adjustment could help make it a more joyful activity. \n---\nAs I begin expanding on an idea, I discover places where my thinking feels incomplete. Since those areas are connected to what I am writing about, it feels like they have to be addressed. That the piece would be insufficient if I did not incorporate them. This scope creep makes sense if my goal is to publish complete airtight arguments. But that would be impossible to do on a weekly basis. My writing practice is instead focused on creating a space to explore the intricacies of an idea in more depth. Rather than writing about a topic once and moving on, I want there to be repetition in my writing. Repetition means I am returning to the same themes and building depth over time. Rather than each piece being a standalone, the body of work I am developing is defined by all the different pieces coming together. \n\nDecreasing the scope of each piece is also important because the longer a piece, the more that is asked of the reader. When I am reading sometimes I get stuck reading the same sentences over and over because my mind was wandered. Good writing does not ask the reader to force themselves to pay attention. It keeps the user’s attention by simulating them. One way to keep a users attention is by removing excess and focusing on brevity. \n\nMoving forward I am going to keep each piece a lot shorter. While writing I am going to cut anything that feels extra. If an idea feels really important I will return to it in a later piece. \n---\n\nWhen I begin writing, there is no structure or formula that I follow. I write down any ideas which seem to be connected. Once I start putting those ideas into paragraphs I re-organize them into a sequence mostly by intuition. I do not have tactics for determining the structure of each piece. This lack of process makes writing difficult since it forces me to regularly think about what sequencing makes the most sense. It also probably leads to a worse end product because I am not using any principles to organize my thinking.  \n\n Hanif Abdurraqib, one of my favorite writers, describes his process as moving through the following progression:\n1.  What do I not know but am curious about?\n2. What did I just find out?\n3. How can I make this exciting to someone else?\n\nHe uses this progression to formulate what each piece is going to be about. Every piece starts with something he wants to learn more about. He then has to put those learnings into a form that would be exciting to someone else. Having this process provides concrete steps that need to be taken with every creation.\n\nIt could be helpful for my creative process to have some defined steps similar Hanif’s. Looking back at the pieces I have written the following progression could make sense: \n1. What is an observation about something that I care about?\n2. Why might this observed phenomena be happening?\n3. What would a world look like if this observation were different?\n\nIf I had applied that progression to this piece it might look like the following:\n1. *Observation* : I am motivated to write regularly, but I find it really difficult to do so consistently\n2. *Why:* I  find writing difficult because I try to write too much and have no structure in mind when I start creating\n3. *Difference*: Decreasing the scope of each writing piece and having a more defined process could make writing easier.\n\nFor future pieces I am going to try using this structure to formulate my ideas. I will put this small summary at the beginning of each piece. \n\n---\nOne tactic for making hard things easier is to use social accountability and community. Waking up at 6am to work out in college was always accomplished because I knew all my teammates were going to be at the gym as well. It feels more overwhelming and isolating to do things alone. \n\nWhen I bring up my motivations for writing, I mainly discuss it as something that I am doing for myself. While one of the primary audiences of each piece is myself, it also feels important to acknowledge that ideally writing would be a way to connect with others. I am putting these ideas in a form that others can digest, because I want feedback. \n\nI have found that having a particular audience in mind is a critical aspect of creating good work. When I create a presentation, it is helpful to understand what context my audience is coming in with. At work, my presentations look very different if I am presenting to my team, the entire engineering organization or the entire company. For this writing project I have neglected to pick a specific audience that I am writing for.\n\n Moving forward I am going to imagine that I am writing these pieces for my close friends. I am writing these pieces because I want their feedback, wanting to hear how their experiences are similar or different from my own. Inspired by [RFCs](https:\/\/en.wikipedia.org\/wiki\/Request_for_Comments) I am thinking of referring to my writing pieces as VGCs (Vibe Generalization Checks). I am writing to check if the vibe that I am feeling generalizes to others. Going forward I am going to send out each piece as an email. \n\n\n\n"],"filename":"writing_process_updates"},{"created":1673018637432,"modified":1676301614185,"title":"Repeated Generator","status":"Finished","tags":["writing"],"blocks":["Why I am drawn to writing","Why writing is a powerful tool","The benefit of generating written artifacts","My difficulties with writing","What is Repeated Generator"],"blocks_text":["\n\nWhen Jenny (my partner) and I are in different places physically, we stay in touch through writing. This was especially the case when we were living in different cities for a year. During that year our primary mode of communication was writing emails to each other. Writing emails creates a different intimacy than talking on the phone. Writing an email can be a more reflective process than a conversation. There is no back and forth; no ability to check if the other person is comprehending what you are trying to convey. The writing process forced me to think more about how to communicate.\n\nOne of the reasons I am drawn to writing is because of the direct impact it has on my thinking. Since writing is such a different medium \/ interaction than conversation it generates different creations. It leads to my actual thoughts being different then they would be in a conversation. It is more than taking what is in my head and putting it onto paper. With writing it is important to be precise and concise. It is much more obvious when the author does not have clarity of thought because the writing is difficult to follow. I personally find that the process of writing makes me a sharper thinker.\n\nAnother reason I am drawn to writing is due to how much I am influenced by everything I read. Since I  [graduated from college](https:\/\/medium.com\/the-fox-and-the-hedgehog\/why-blog-11a7a0c166ef)  I have been trying to write more and I have often used what I was reading ( [books](https:\/\/judahgnewman.com\/#\/medium\/book)  or  [papers](https:\/\/judahgnewman.com\/#\/medium\/paper) ) as a jumping off point. Reading other’s work allows me to learn from their experience. I can understand some of the depth of what they have learned without having to go through the same experience as them. Reading is powerful not only because I can learn from others but also because it makes me feel connected to the author. Reading someone’s writing is an opportunity to understand more about the author and what motivates them to create.\n\n","\nFrom my  [initial explorations](https:\/\/judahgnewman.com\/#\/)  with writing I have learned that writing is a **dynamic iterative process** of developing and refining ideas. The first step is taking an initial idea that is a simple spark and chronicling it. Moving the idea from my head and putting it onto the page. Once the idea is on the page it becomes easier to proceed with its development. I can start evaluating if it has some merit. What are the ways it needs to be pushed or expanded? By moving the idea outside of my head and onto the page I am able to interact with it differently.\n\nPutting the idea outside of myself provides a distance that makes refinement easier. When I am further away from the idea, I associate it with myself less and can do a better job of objectively understanding it. I find that writing over the course of a few days also helps provide that necessary distance. When time has passed since I last looked at the piece I am able to view it with more clarity. That cognitive shift of dissociating the idea from myself can be harder to do without the process of writing. By forcing this shift, writing helps my mind follow a process for being a strong thinker.\n\nIn this way, writing is an iterative two stage process. The first stage is putting what is in my head onto the page. I aim not to worry about quality or how others might perceive it. Now that there is an artifact I can read, I can interact with the idea in a new way. As a reader I am able to be critical of the writing and identify what needs to improve. I am forced to put myself in the shoes of someone who is not as familiar with the idea because it is not their own creation. I then go back to the step of taking what’s in my head and putting it on the page. Through this process I slowly improve the piece.\n\nThis iterative process makes writing a powerful tool to help reach clarity of thought. When I am thinking about an idea only in my head it is not usually clear where the weak points are. But once I start trying to make it accessible to others, that lack of clarity becomes evident. It is most often not a problem with the communication, but rather the communication is bad because there is not clarity in the thinking. Writing without clarity is immediately evident and so if I want to be a good writer it forces me to deepen my thinking.\n","\n\nWriting is so powerful not only because of the impact it has on my thinking, but also because it generates an artifact. The creation of this artifact leads to a few really fun properties\n1. **Writing can be shared or scaled to anyone**: Once I have done the work it is then trivial to share it with others. There is the fixed cost of doing the writing, but there is essentially no extra cost for each additional person who reads it.\n2. **Writing generates a lasting chronicle**: Each writing piece is a snap shot of thinking at a given point in time. That artifact can be returned to at a later date. It can be used to better understand the author, the time period and even patterns in the authors thinking.\n3. **Writing can create a genuine connection between people**: While this connection is different than other forms of communication it is amazing that it can happen in the written medium. Really good writing connects its author to its readers in an emotional way. The best writing forms a powerful connection between the author and its readers.\n","\nWriting’s beneficial impact on my thinking and the benefits of having a written chronicle are what have motivate me to write. I have mostly used my own reading as a jumping off point for writing. I have occasionally  [written pieces](https:\/\/judahgnewman.com\/#\/medium\/personal)  that did not focus on another written piece but I always found it quite difficult. Writing these pieces would be a drawn out process. I would leave them in an incomplete state for a long period of time. But when I would complete those pieces, there were by far the most rewarding.\n\nWriting these pieces involved a lot of time and mental strength. While writing is a good way to reach clarity, it can also be quite difficult. Currently, it takes both intense focus and determination for me to write. While I am writing I need to both think at the local scope of an individual sentence while still ensuring that each sentence and paragraph connects to my overall point. Writing can be demoralizing at times when I keep seeing the ways I do not quite have clarity. Good writing is something that takes me a lot of time.\n\nSince I believe writing to be so beneficial, I want to find ways to not only improve my writing, but also the writing process. I want to decrease the mental energy it takes me to sit down and write. I want to be iterating on ideas over extended period of times, slowly fleshing them out. When I struggle to reach clarity, rather than being frustrated I want to recognize that is the exact the reason I am writing. Part of improving the process is changing my emotional relationship with writing and part of its developing practices that reduce as much friction as possible.\n\n","\n**Repeated Generator** is a project to help me deepen my relationship with writing, idea generation and sustainable processes. The best way to become a better writer is to write a lot. Writing a lot makes me a sharper thinker and leaves a lasting chronicle of what I am thinking about. Being forced to write something novel every week will necessitate that I develop a system that makes writing easier. This project is as much about developing a writing process as it is about doing the actual writing.\n\nI am going to publish one writing piece every week on Sunday night. While I want each piece to be high quality and something I put time into, the main focus is about putting in time every week. I want to give myself the chance to try out different types of writing. Not every piece is going to be perfect the first time around. As long as I am constantly devoting time to this project each week and publishing something, it will be a huge success.\nWhile I am excited to see where my mind goes and what I end up writing about, there are a few topics I already know I want to explore. These are:\n* The writing process and how this project is going\n* The future of certain technologies - I want to chronicle my opinions and see how they compare to what actually happens\n* Believe formation at both the individual level and societal level. How public opinion has changed\n* The science of doing science, the history of science and knowledge creation\n"],"filename":"repeated_generator"},{"created":1651226219728,"modified":1676301616804,"title":"Motivation for working in Novel Spaces and Quantum Computation","status":"Finished","tags":[" quantum","career_decisions"],"blocks":[],"blocks_text":["\nIf I am being completely honest with myself the decisions I make are often driven by wanting the approval \/ admiration of others. This happens both consciously and in a deeply internalized way. There are absolutely times when I am consciously aware that certain actions will improve how others perceive me. The more subtle instances are when I have crafted a story around why X is important to me. But really X is important to me because it is important to others. Doing well in school was deeply internalized as one of my values, because I was consistently shown that others admired people who did well in school. \n\nMy desire to spend my energy on projects that will have a [large impact](https:\/\/repeatedgenerator.netlify.app\/posts\/week_5_impact_and_proximity\/) is partially driven by wanting approval. Society valorizes individuals who have large impacts. We are taught about the great women and men of history. The brilliant activists, policy makers, scientists and artists. I was consistently messaged that one way for my existence to be valuable is to achieve something that society will admire. \n\nMy initial reaction to recognizing this desire is to question how healthy it is. Doing something solely for others approval can be dangerous. I have found that when I am too focused on winning someone’s approval, I often hurt someone else. I am fixating on success in such a narrow way, that I cause harm. This desire for approval from others is not necessarily bad. Caring about others opinions’ is an important aspect of how humans build community. It allows us to develop a set of commonly accepted behavior. I am not making every decision from a blank slate but can rely on commonly accepted wisdom that has been built across many people and generations. \n\nWhen investigating my desire to be approved by others, it is critical to ask who are the others. There are some others whose opinion I care more about and some others whose opinions I probably do not care that much about. \n\n---\n\nI am most concerned with the approval of the people I spend time around. Since I spent so much of my time in an academic environment I want approval from people who also attended expensive educational institutions or who work in higher paying tech \/ academic jobs. \n\nSince these opinions are the ones that currently motivate me, I am attracted to working in fields that are less developed. This motivation means that I have a lot of energy \/ excitement when thinking about projects in less developed fields. When I was doing academic research on machine intelligence I was so energized everyday. That energy derived from feeling like there was a chance that I could actually make a meaningful contribution. It is easier to make a contribution in areas that are less developed for the following reasons.\n\t* Often there is less background knowledge and years of studying that is needed to get to the cutting edge of the field \n\t* The methods for doing research are less defined and having a unique approach can be really important \n\t* The rate of progress in the field is quite rapid\n\nDue to this interest of working in newer \/ less explored fields the topics I am currently most interested in are:\n\t* Understanding intelligence (neuroscience, biological systems, synthetic biology, machine learning) \n\t* Designing collective organizations (organizational structure and blockchain governance)\n\t* Tools for creation (quantum Computation and creativity tools) \n\n---\n\nIn the past month or so, my friend Holly and I did some background reading on quantum computation to understand if we would be interested working on problems in that space. The goal was to understand the current state of the field and identify what problems are the most promising to work on. We decided to not continue exploring this space for now because it feels like quantum computation is still relatively far away and the projects in this space do not seem like a good fit for us.\n\nSome quick synthesis from our reading:\n\t* Building quantum computers is really hard. Manipulating qubits without errors is really difficult. People have come up with strategies for handling errors , but they require many additional qubits. This means usable quantum computers are still relatively far away. That being said, cloud computing should make quantum computers more accessible with a  quicker adoption rate than the beginning of classical computers. \n\t* Quantum computation is often taught by comparing it to classical computation. A good teaching technique is to use knowledge people already have, but I think this approach is actually harmful for quantum computation. The use cases for quantum computers are so different than the use cases for classical computers. Many sources focused on how we can do everything with a quantum computer that you can do with  a classical computer. While the proof for this is true, I feel like it leads people astray. Quantum computers have different strengths and different use cases from classical computers. We should not message them as more universal computers. \n\t* Quantum computation does have the potential to do some really interesting tasks. Using qubits we are able to simulate systems in a way that is essentially impossible with classical computing.  The first meaningful use cases of quantum computation will involve simulating real world systems. If I were going to keep spending time focusing on quantum computation, I would try to understand these use cases. These use cases are less reliant on a large number of qubits and a much more natural fit for quantum computers. Here are the papers I identified that touch on this idea\n\t\t* [Simulating Physics with Computers ](https:\/\/link.springer.com\/content\/pdf\/10.1007\/BF02650179.pdf) \n\t\t*  [Simulating Chemistry](https:\/\/arxiv.org\/abs\/1007.2648) \n\t\t*  [Simulating Quantum Dynamics](https:\/\/arxiv.org\/abs\/1011.3489) \n\t\t*  [Reaction mechanisms](https:\/\/www.pnas.org\/doi\/epdf\/10.1073\/pnas.1619152114) \n\t\t*  [Solving correlated electron models](https:\/\/arxiv.org\/pdf\/1506.05135.pdf) \n\t\t*  [Quantum for chemsity](https:\/\/arxiv.org\/pdf\/1706.05413.pdf) \n\n\t* I think we will be surprised by the ways quantum computers are used. It will take some time from people to fully understand what the use cases of quantum computers are and how they can be used most effectively since the paradigm is so different from what we are used to. \n\t\nWhat we consumed\n* [Quantum Computing for Everyone](https:\/\/mitpress.mit.edu\/books\/quantum-computing-everyone)\n* [Quantum Country](https:\/\/quantum.country\/)\n* [Quantum Computing for Computer Scientists - Lecture](https:\/\/www.youtube.com\/watch?v=F_Riqjdh2oM)\n* [The Potential Impact of Quantum](https:\/\/arxiv.org\/pdf\/1712.05380.pdf)\n* [Quantum Computing in the NISQ Era and Beyond](https:\/\/arxiv.org\/pdf\/1801.00862.pdf)\n\n"],"filename":"motivation_for_working_in_novel_spaces_and_quantum_computation"},{"created":1665132009842,"modified":1676301619564,"title":"Chron - Product Spec","status":"Finished","tags":["eka","writing"],"blocks":["Introduction","Structuring my writing practice","Tool Details - Writing Structure","Tool Details - Viewing Structure","Tool Details - Viewer Affordances","Tool Details - Editor Affordances","Starting Implementation Ideas","Possible Extensions","Inspirations"],"blocks_text":["\n\nWriting is a tool for dynamic discovery. Regularly formulating my ideas through writing helps me reach a deeper and more nuanced understanding. Writing particularly helps me identify aspects of my thinking that are fuzzy since I am unable to clearly articulate them. If I am unable to succinctly express my opinion then it highlights a place where I need to do further exploration. Writing helps me extend small sparks of ideas into more coherent pictures. It has been clear to me for a number of years how important this process of discovery is. Having a writing practice is more than finding the correct way to express something that I know. The process of writing is literally where I form my opinions and believes.\n\nWhile having a writing practice has repeatedly shown it’s importance to me, it is still something that I struggle with! I have tried a number of different times to start projects related to writing, with all of them eventually sputtering out. The [first attempt was in 2018](https:\/\/medium.com\/the-fox-and-the-hedgehog\/why-blog-11a7a0c166ef) and had little structure beyond wanting to write regularly. I took other stab at the beginning of 2021 with my [[Personal Archive Project]]. At the start of 2022, wanting to write more, I came up with the project of [[Repeated Generator]]. Part of this project was understanding the structure of my [[Writing Process]] better. While this project was not what I originally envisioned,  in 2022 I wrote more pieces that I was proud of than any previous year by far. Writing so much helped me learn about how to structure my writing practice to get the most out of it. \n\n Now that I have a better understanding of how to structure my writing practice I want to start building some tooling to help facilitate the process. From pushing myself to write more, I learned more about how imposing some structure on my practice can be helpful. I have started imposing some structure on the way that I write and it has really improved my practice. I believe that directly incorporating this structure into my writing tooling will help improve my writing practice. The main enhancements I am looking to achieve from creating my own tooling are:\n\n1. It will help me push more of my writing into a finished state.\n2. It will help me get more value from previous pieces I have written\n3. It will help me finding connections and patterns across multiple pieces I have written.  \n","\nMost word processors or note taking tools use a blank document as the fundamental unit. My writing process works best when I break ideas up into smaller units. It can be difficult when I am always thinking at the scope of an entire document. When I first start having an idea it is not a full document, it is a brief thought. As I start expanding on that beginning, it is helpful to break up my related ideas into distinct units. I want my writing tool to use this structure, rather than dropping me in a blank document. Word processors are are powerful tools since their flexibility allows them to support many different writing pursuits. Since my tool only has to support my own writing practice I can make it fit that use case tightly.  \n\nAt a high level here is the structure that I want the tool to follow:\n1. Each **piece** of writing is a collection of smaller related ideas. These small ideas should are related to each other forming a more overarching narrative.  We will call each of these small ideas a **card.**\n2. There are common themes that I am exploring in my writing which I will return to over time. Each piece is connected to one or more theme.\n3. It is important to push pieces towards a finished state. I do not want all my half baked ideas milling around in my tool forever.  I should either turn them into a finished piece or I should abandon them. Finishing a piece does not mean it is the last time I will think about it but it means done for now. \n4. It should be easy to explore my writing. I want to see how ideas have changed over time and how different ideas connect. There is not one defined path to an idea, but the same idea can be reached in many different ways. \n\nThe next few sections go into more details about how a piece of software will actualize this structure\n","\n- My basic unit of written work will be called a **card**.  A card is a paragraph or a couple of paragraphs about one idea. A card will have a title summarizing the topic.\n- Each written **piece** is a collection of one or more cards. \n- All collections have one or more **series**  they are a part of.  A **series** is a topic or category that explains what is in the content of the collection of cards. A collection of cards can be in more than one series. Some example series are `whoami` `meditation``writing`…\n- This tool will include **pieces** which are in different stages of completion. Each piece will fall into one of three categories:\n\t1. Finished\n\t2. In Progress\n\t3.  Abandoned \n","\n\nThe details below define how the writing structure will be displayed to a viewer. To making navigating all writing pieces easy, I want the tool to have the following properties.  \n\n1. It is easy to navigate from one idea to the next. It should feel so easy to quickly jump around to other ideas.  \n2. There are many different paths a viewer can take to the same idea. There is not only one path to discover an idea.  \n3. Each idea might appear in multiple spots.  \n\nTo achieve this, the software tool will have three separate components. These components are\n\n1. **A series viewer** - Appears as a column on the left side of the screen. Allows the user to select a specific series they are interested in. Provides high level details about that series. \n2. **A card collection viewer** -  Appears as a column on the right side of the screen. Allows the user to select a specific card collection they are interested. Shows all the cards in that collection along with a small table of contents. \n3. **A card collection canvas** - Occupies the middle of the screen.  A canvas that shows all the other pieces associated with what is currently open in the Series Viewer and the Card Collection Viewer.  There are four different possibilities for how the canvas will be populated based on the active pieces.\n\n\n\t1. Series viewer = Empty, card collection view = Empty:\n\nThe canvas will contain every series with all the pieces in that series. Every single card collection will be on the canvas.\n\n\t2. Series viewer = Active, card collection view = Empty:\n\nThe canvas will contain every card collection which is present in that series. The canvas will have a colored border which corresponds to that series to show that every piece is in this series.  In the canvas all of the pieces will be organized based on the other series they are in. There will be smaller boxes for each overlapping series and all the pieces in that overlapping series. If a piece is in multiple other series it will show up in multiple places on the canvas.\n\t\n\t3. Series viewer = Empty, card collection view = Active\n\nThe canvas is not surrounded by one box, but has multiple boxes on it for each series. Every series that is associated with the current card collection shows up on the canvas. Pieces which are are directly linked to from the current piece are highlighted with a special color.\n\n\t4.  Series viewer = Active, card collection view = Active: \nThe canvas display is mostly determined based on what is in the card collection. The active series also gets displayed on the canvas.\n\n","\nNow that we have defined  how different pieces of writing will be displayed we can define how we want users to navigate the writing. When a user first lands on the website they will be presented with an introduction screen giving some background details about the project. They will then have the opportunity to enter the tool at a few different starting points. Users will then be able to change what is active in the three sections through these interactions. \n\n- Clicking on a series box will make that series active in the series viewer. This will then update the canvas to have all the collections from that new series.\n- A collection can be clicked on and that collection will pop up in the collection viewer on the right side of the screen.\n- A viewer can zoom in and out on the canvas. At the default zoom only the title of cards is shown. As you zoom in enough on a card the text that is contained in the card will also show up.\n- The user will have the ability to X a series or card collection.\n- In the top right corner the user will be able to toggle which stages of pieces they want to see. They might only want to see finished pieces, or only want to see pieces that are in progress.\n\n","\nThe above three sections have defined the details of how to view static text pieces. In this section I am going to give details of how I want to edit text.\n\nFor each collection of cards the user will have the following abilities\n\t1. Change the title of the collection\n\t2. Change the title of a card in the collection\n\t3. Change the text of a card in the collection\n\t4. Change the order of cards in the collection by dragging them\n\t5. Remove a card from the collection by dragging it onto the canvas\n\t6. Add a card to the collection by dragging it onto the collection\n\t7. Add a card to the collection by clicking a plus button at the bottom of the collection\n\t8. Switch the state of collection from In progress, to finished or abandoned. \n\t9. Update the series that the collection is associated with\n\nThe user will have the following abilities through interacting with the canvas\n\t1. The ability to create a new card. This will be done through a left click on the canvas\n\t2. Group together multiple cards into one collection. This will be done by dragging one collection of cards onto on top of another\n\t3. Move a card in or out of a series. This will be done by moving the card inside or outside of a series box.\n\t4. Change how a series displays on the canvas. The user will be able to do this by dragging around Cards within the Series.\n\t\n","\nThe tool that I have outlined here has a lot of different parts. I am going to develop it iteratively. Here are some of my initial ideas about how I might go about the development to make the process a bit easier.\n\n1. I am going to start by just working on the viewing functionality and not the editing functionality. I can keep using Bear as my writing platform for now and just export all of my notes from there.\n2. Everything needed to render all the writing correctly will be stored in the text of the documents. There will not need to be a full fledged database. Here is some ways we will add structure to the documents so that everything can be stored in them.\n\t- The first line of a document is a single # header with the title of the piece. \n\t- After that comes a line which defines all the series. Each series is surrounded on both sides by a #\n\t- Each card begins with a ## header. Every card ends with a "," divider.\n- I am going to use a [router](https:\/\/reactrouter.com\/en\/main) to make it so that links to certain pieces or cards can be shared. The url will contain three pieces of information. The series, the piece and the active card.\n\n","\n\nIn this document so far I have only outlined my beginning ideas for Chron. I have a number of ideas for how to extend Chron that are not fully fleshed out. Briefly they are: \n\n\t* It could be nice to have the layout flexible enough that someone could view multiple card collections at the same time. Often when I am reading a piece and it links to another I want to look at that other piece without leaving the current piece. We could accomplish this by having pieces stack to the right. When you open another card collection it goes to the right of the current piece and the screen scrolls to the right. \n\t\n\t * As I have more pieces contained in this tool it might be helpful to have series nested in side of each other. For example there might be a series `writing.tooling`. Tooling is a series that is completely inside of the writing series. As one series gets quite large this is a way to provide additional structure to the series.\n\t \n\t * I have some interest in adding some functionality related to each piece having an intended audience. I have found  is helpful to have an intended audience that I am thinking of when I write. This functionality could also help direct readers to how some other writing might be a good prerequisite before reading the current piece. \n \n\t* I interested in adding functionality which forces me to return to ideas. I either have to continue making progress on them or they are killed off. This prevents me from leaving ideas hanging around all the time. We might call this functionality “weeding“\n\t\n\t* I am also interested in adding functionality related to writing exercises. Sometimes it can be helpful to do a writing exercise with some format to get my brain flowing. It could be nice to have some ability to start a writing exercise when I am struggling on a piece. \n\t\n\t* There is some interesting displays I could add related to version history. It could allow the user to see how a piece has changed over time or how the entire series has changed over time. \n\t\n\t* I will be interested in understanding how different users interact with the pieces. I would be curious to track the different paths that users take through all the different pieces.\n\t\n\t* It could be nice to have some ability for other users to leave comments on my writing. Part of the reason that I write is to get other people’s reactions and having comments integrated in the tool could be a really nice way to do that.\n\n","\nA lot of the ideas for Chron are inspired from other tools that I have used. I want to briefly mention some other tools that inspired me. \n* Bear\n\t* this where the multiple series comes from\n* Muse\n\t* This is where the canvas comes from \n* Roam Research\n\t* this is where the linking between pieces comes from\n* Gamma and Tome\n\t* this is where the card idea kind of comes from \n* Notion \n* Andy’s Notes\n\n"],"filename":"chron_-_product_spec"},{"created":1654512279413,"modified":1676301623394,"title":"Crypto and wealth creation","status":"Finished","tags":["crypto"],"blocks":["Motivation ","Model for understanding wealth","How crypto might create wealth","What is wealth?","More Questions"],"blocks_text":["\nWhat I find appealing about the web3 \/ crypto space is it’s [transformative vision of the future](https:\/\/repeatedgenerator.netlify.app\/posts\/week_3_here_to_now\/). The other week I was reading  [this piece](https:\/\/rhyslindmark.substack.com\/p\/what-happens-when-the-rebels-win?s=r)  about what 2040 could look like as web3 continues to grow.  Before describing a possible future the author focuses on crypto’s wealth generation. They argue that crypto will continue generating wealth. This wealth will be spent on projects creating a better world. (From the piece is not clear why this future is better besides the assumption that decentralized is better than centralized).  \n\nWhile I support imagining better versions of the future, this piece left me confused about the current state of crypto. It seems true that crypto has generated a lot of wealth, but how exactly did it do that? \n\nThis piece is my exploration of : **How is crypto generating wealth**?  To dig deeper on this I begin with some building blocks we might need to answer this question. \n","\nIn my undergraduate studies we encountered macroeconomic models for how a countries wealth changes ([GDP](https:\/\/en.wikipedia.org\/wiki\/Gross_domestic_product) is the traditional measure used). Measuring the wealth of an entire country is complex so these models use simplifications to make the task manageable. Some of the simplest models use population growth as the driver of wealth. A countries’ wealth is dependent on how much labor is available. As the population grows so does the amount of possible labor. More labor = more wealth. This link between labor and wealth makes sense at personal level. I work for a company which  pays me money increasing my personal wealth. I use my labor to increase my wealth. \n\nIf we dig a bit deeper on the relationship between labor and wealth a lot of complexity bubbles up. Some thoughts about this relationship based on my own experiences\n\n\t\t\t* Not all labor is equal. One project might create more wealth than another. One person working on that project might create different amounts of wealth than another. We recognize this by paying people different amounts and different jobs paying different amounts\n\t\t\t\n\t\t\t* Increasing the amount of labor does not simply map to how wealth will increase. If I worked on a project for 20hrs rather than 10hrs would the amount of wealth that I generate double? There is most likely not a linear relationship between amount of labor and amount of wealth.\n\t\t\t\n\t\t\t* The amount of wealth I generate with an hour of labor changes over my lifetime. As I have more experience, develop more skills, one hour of my time becomes more productive. This is manifested in more senior workers getting paid a higher salary  recognizing that their time is more valuable. \n\t\t\t\n\t\t\t* The amount of wealth I generate is not only dependent on my ability but also the tools that I have at my disposable. Without a computer it would be really hard for me to work. \n\nMacroeconomic models have different specifications to deal with these complexities. They take into account capital accumulation (how much I have spent on tools),  technological progress \/ productivity (How helpful those tools are) and even knowledge accumulation (how much experience I have) . There is one aspect  which shows up in most of these models that I have not touched on yet;  the investment \/ savings rate.\n\nAnother way to grow my personal wealth is by investing the wealth I receive from labor into other sources. Investing money is hopefully a mutually beneficial relationship between the investor and the company.  The investor fronts the company to help them create something that will generate wealth later give. Eventual the company will capture some of the wealth they are creating. The company should then return that wealth to the investor. In exchange for the investor giving the company money now, the money received in the future should be larger than what they invested.  This agreement is easiest to understand with companies that pay out [dividends](investopedia.com\/terms\/d\/dividend.asp). Eventually the investors earns back their [principal ](https:\/\/www.investopedia.com\/terms\/p\/principal.asp)  and then some. \n\nWhile investments in our present day society have become more complicated, this type of relationship is really important for wealth creation. Investment acts as a **coordination mechanism** allowing projects to be funded that otherwise would not exist. In exchange for allowing others to work on a project, investors have the opportunity to grow their own wealth. In the macroeconomic models countries with a higher investment rate grow their wealth quicker. This higher investment rate means more projects are attempted. \n\nThere are many economists who spend their full time studying these concepts. My quick explanations do not do their work justice, but having this foundation will be important for understanding crypto’s wealth generation.\n","\nIn the framework we have been exploring there are two components:  A group of people and a measure the wealth they hold. That group of people could be an individual, an organization, or a country. For each of these groups we have a way of measuring their wealth. For an individual it is the sum of their assets, for a company it is it’s valuation and for the country it is GDP. The amount of wealth of the group depends on  labor, technological progress and investment.\n\nIn our society we use currency as the unit to measure wealth. My personal wealth measurement, a company’s valuation and GDP are all in units of dollars. Currency is a unit that allows us to compare very different assets. We are able to compare the value of an apple to that of a pear. The value of a flight across the country to the value of a laptop.\n\nNow that we have a framework, let’s return to our original question, **How is crypto generating wealth**?  For crypto to be generating wealth we need to identify our two components. The group of people is people who own crypto assets (bitcoin, ethereal etc…). The measure of wealth is the total value of those crypto assets. Crypto is generating wealth because the value of those assets are increasing.  Using our framework two possibilities emerge about why the value of those assets are increasing:\n1. Crypto assets are investments in a new technology which has the potential to generate wealth. \n2. Crypto assets are a new currency representing a larger share of wealth that already existed. \n\nUnderstanding crypto is difficult because it is a new financial instrument. It does not map neatly into our previous categories. It is simultaneously both a currency and an investment in a new technology\n\n**Crypto assets are investments in a new technology which has the potential to generate wealth.** \nWe can simplify buying crypto to be making an investment in a new technology. Buying crypto gives the people working on that technology money. For your investment to be worth it, the technology eventually must create wealth that will be returned to you. A tricky thing about investments though, is that they are based on people’s expectations about the future. If people’s expectations about the wealth crypto will generate are much larger than the truth, then we will have a [crypto bubble](https:\/\/en.wikipedia.org\/wiki\/Economic_bubble). \n\n2. **Crypto is a new currency that represents wealth which already existed**\nWe could also simplify crypto to being a new currency. Each unit of currency represents a certain amount of wealth. Crypto becoming worth more means that other currencies are becoming worth slightly less. In this world crypto is not creating wealth but rather representing a larger share of existing wealth.\n\nCrypto does not fit neatly into either one of these categories. It’s wealth generation could be derived from both of them. Crypto is a new financial instrument coupled with a transformative vision of the future. Some of the excitement about crypto is about the possibilities with the new technology, but a lot of it has also been about how this new financial instrument has generated a lot of wealth for people. Whether or not crypto actually generates wealth in the long term will be decided by the people in the crypto community. If the resources they have gained from this financial instrument are actually used to create value then it will not be a wealth transfer mechanism but a wealth generating one.  \n\n","\nWhile writing this piece, there has been a question I have avoided which has been nagging me. **What actually is wealth?**  So much of our society is organized around wealth. There is an inherent assumption that more wealth is desirable and we should aim to grow our measured wealth. \n\nAt some level, there needs to be a connection between wealth and our values. When I purchase an item, I am stating that I value that item. The amount of money that I pay for it is a measure of how much I value it. In theory, wealth should be strongly connected with improvements in the human condition. When we are creating wealth we are doing something that improves people’s lives.\n\nBut clearly, wealth does not perfectly represent improvement in human life. People who are wealthier are not always better off. There are many things which improve the human condition which currently are not taken into account in wealth measurements. In a healthy society our measurement of wealth is probably quite closely tied to actual improvements in the human condition.\n\n","\nThis exploration has been helpful, but it has left me with even more questions than I started with. Some of those are: \n\t* If  our current measures of wealth do not accurately represent human health \/ values what do they represent?\n\n\t* While wealth does not perfectly represent human values, there still is some connection. What happens to our understanding of wealth as human values change? If everyone started valuing public spaces a lot more how would that change our understanding of wealth? \n\n\t* Our financial system has become quite complicated. Does all this complication create a better and more robust system? How do we measure if  our system is working well? It feels like our system is quite susceptible to bubbles currently. The complication has made it difficult to actually value an asset.  \n\n\t* How does currency exchange work? What does it mean when one currency becomes more or less valuable? \n\nThanks to  Basil Halperin, Holly Ormseth, and Jenny Wang for discussions that inspired this exploration. "],"filename":"crypto_and_wealth_creation"},{"created":1658228730437,"modified":1676301626093,"title":"Getting spaced repetition to work","status":"Finished","tags":["learning"],"blocks":["My struggles with spaced repetition","What I learned from the Articles","My Ideal System","Generalizing “The Return“ Beyond Memory","Extensions of Spaced Repetition"],"blocks_text":["\n\nOne of my favorite creators, [Andy Matuschuk](https:\/\/andymatuschak.org\/) is building [Orbit](https:\/\/withorbit.com\/), an extension of the written medium to increase how much information readers retain.  Andy’s work is quite inspiring, pushing me to re-evaluate why I read and how I can get more out of it. I spend so much time reading that there would be large returns to making that time more effective. \n\nOrbit is centered on bringing [spaced repetition](https:\/\/en.wikipedia.org\/wiki\/Spacing_effect) into the reading experience. Spaced repetition uses software to schedule flashcard review to aid moving information into long term memory. Essentially it surfaces a fact you want to remember, right before you are about to forget it.  You simply inform the software “I want to remember X“  and the system’s scheduling makes sure that you do. Spaced repetition is so powerful because minimal time investment greatly increases how much information can be retained.\n\nWhile spaced repetition seems so compelling, and I have multiple friends who swear by it, I have been unable to effectively practice it. Multiple times, I have created a bunch of cards, but I have failed to consistently commit to reviewing the cards.\n\nSome of the reasons why I have struggled to consistently apply spaced repetition are:\n1.  Reviewing cards can feel a little contrived. When I review, it does not feel connected to any of my goals. It feels like I am studying cards  so that I have some information in case it might be helpful later.\n2. When I review it is divorced from the original context where I encountered the information. I sometimes am not sure why I thought this fact was important. \n3. Creating review cards while I am reading,  degrades the reading experience. When I am reading I do not want to be taken out of the experience. \n\t* Andy has built some prototypes where card creation is embedded in the reading experience. This co-location vastly improves the experience of creating cards.\n4. Once I get behind on reviewing cards, there is a large backlog of cards I am supposed to review. This backlog becomes overwhelming  making me avoid review entirely. \n\nI am fully convinced that having a spaced repetition practice would help me, so I want to find a way to consistently review cards. Committing to any new practice consistently is difficult. Especially one with no immediate pay off. A similar type of practice which I have at times struggled to do, but generally do consistently is meditation. I have made meditating on a daily basis a lot easier by reading about meditation. Reading about meditation reminds me of my motivation to practice. I am going to try a similar tactic for spaced repetition. \n\nI read the three pieces below about spaced repetition:  \n\n- [Augmenting Long-term Memory](http:\/\/augmentingcognition.com\/ltm.html)\n- [Spaced Repetition for Efficient Learning](https:\/\/www.gwern.net\/Spaced-repetition)\n- [How To Remember Anything Forever-ish](https:\/\/ncase.me\/remember\/)\n\n","\n\nReading the articles has reinvigorated my motivation for having a spaced repetition practice. There were a few pieces of information in the articles that will help improve my practice. They are: (Note: The Michael Nielsen article was by far the best one)\n\n1. Spaced repetition is a skill that I need to practice. Creating cards that I am motivated to learn which prompt me in the correct way is a skill. Since creating cards is a skill,  it makes sense that I might have struggled to adopt the practice. I need to build up my space repetition skills.\n2. I should begin my practice with a use case that has the following properties: \n\t1. It is a space where memorizing a lot of information is very helpful\n\t2. It is an area that I am  newer to\n\t3. It is an area where I am  very motivated\nStarting with this type of subject will help me develop the skills necessary to tackle subjects which are not as good of a fit. \n3. Turning a piece of information into question and answer is part of the process. Spaced repetition is much more effective for cards that I have created  rather than generic cards someone has created about a subject. \n4. Spaced repetition is about helping me maintain rather than helping me learn or build.\n\nI am going to start by focusing on all the reading I have done about meditation as a use case. This is an area where I am taking in a lot of new information, have had trouble maintaining all of it and am very motivated to learn it.\n\n","\n\nWhile I hope the above adjustments will support me having a consistent high quality spaced repetition practice, there are also ways to improve my software tooling to make the experience more approachable. \n\n1. As I mentioned before, having the process of creating cards directly embedded in the reading medium is really helpful. \n2. To further improve my reading experience, I would prefer to not have to create the card while reading. Instead I could simply highlight a section and optionally add a note.  As part of my review process, I would also be prompted to turn my highlights into question and answers. \n3. When I am reviewing, when I see the answer side of the card, I also want to then see the original context the information is from.  I could see the original quote that I first highlighted. \n4. The review process should also involve some amount of filtering of cards. While I am reading, I want there to be low friction to highlighting. When I am turning into questions later, I can easily discard a highlight and not have it in my review deck. \n\nThese extensions could make the card generation process a lot easier by not degrading my reading experience. A good opportunity to try this flow out would be with books read on the Kindle. I can easily highlight on the Kindle. \n\n","\n\nI have noticed a similarity between the mechanics of spaced repetition and increasing the effectiveness of my time with other activities. If I have fixed amount of time to work on a task, **it is best to spread that time across different sessions**.  Spaced repetition works by spreading my 30 minutes of memorization across multiple days.  Here are some other activities where spreading my time across multiple sessions seems to be more effective: \n\n**Reading an academic paper**\nIn his article Nielsen describes reading an academic paper across multiple different sittings. He starts by doing a skim of the paper, simply aiming to absorb the main ideas. This first read allows him to  delve deeper into the details with a subsequent pass. A third read can go even deeper. Each additional read he understands more of the paper. Once he understands the first ten percent of the paper, it then becomes easier to understand the next twenty percent. \n\nThis technique matches my experience with reading difficult papers. Often with a difficult paper, there are complex details that I do not fully understand initially. It is usually fruitless to keep spending more time trying to understand them on my first sitting. I have had much more success returning to those details in a later session.\n\n**My own experience with writing**\nI have found that returning to a writing piece many times, across multiple days, creates a much better product than writing in one sitting. It is almost impossible to write a good piece in one sitting. Touching a piece multiple times across a number of days on the other hand creates a much more cohesive and dynamic argument. This same principle applies to creating presentations for work.\n\nThese commonalities between other tasks and memorizing information might be a coincidence, but there might also be something mechanistic that creates this effect. Here are some initial reasons why spreading our time across multiple sessions creates a better product:\n1. Within a session, there are decreasing returns to my time. The first ten minutes are the most valuable, then the second twenty minutes and so on.  \n2. Most activities actually require a few different types of work. For writing you need to organize ideas, write prose and revise. Different sessions make it easier to cognitively shift between these different types. Within one session it is hard to make that necessary switch.\n3. Knowing you can work on a task over multiple days means there is no time pressure. This removes some anxiety which was inhibiting your work ability.\n4. The time in between sessions is actually valuable time. While you are not directly working on the task, the task is in your mid space and some amount of integration or synthesis is happening.\n\nWhile there might be some truth in all of these suggestions, the one that seems most applicable to memorization of material is the last one. \n\n","\nOne of the struggles I mentioned early with spaced repetition is connecting practicing cards with goals that I want to achieve. Andy refers to this property as **transfer**. I think by adding additional activities to my review of cards, I might be able to increase how much I am transferring the benefit from my review to other activity. I am interested extending my review  by adding more structure to how cards are connected.\n\nIn the simplest example, we could have a compound card which is a synthesize of two cards. When you review these cards it would show you that they are connected to each other. After glancing at your answer to one card, you also have the option to glance at the other cards. There would also need to be an affordance in the review that allows connections to be formed between cards. Over time my spaced repetition cards might look similar to a [Zettelkasten deck](https:\/\/zettelkasten.de\/introduction\/).  I would not only be remembering more information, but also connecting that information in dynamic ways. Often I am doing reading, to help push and expand my own idea generation \/ writing practice. This web of connecting cards could help me see all the information I am trying to retain in certain directions.\n\nSimilarly, I could use use writing to condense the amount of cards I have about a subject. When I first read a paper I might have 20 cards related to different ideas in the paper. But after subsequent reviews, it might become clearer to me what aspects are actually the most important.  I can slowly synthesize those cards to be just 1 or 2. Those 20 cards represent a summary of what I wanted to take away from the paper. Spaced repetition is a compression of the original source text. As more information is moved into my long term memory I can compress that information even more. So eventually the card might just be summarize the main takeaways from this paper.\n\n\n"],"filename":"getting_spaced_repetition_to_work"}]